/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称：ESF_Tmr.c 
**
**    功能描述: 定时执行的处理
**
**    项目名称：Easy SoftWare FrameWork (简单 软件框架)
**
**    平台信息：
**
**    作    者：Hzy
**
**    版    本：V1.0
**
**    其他说明:
**
**    修改记录: --------------------------------------------------------------
**              2015.08    
**              完成 V1.0 版本
**              --------------------------------------------------------------
**              2016.06 
**              升级到V1.1版本。主要是为了简化有关事件和内存分配释放的使用。
**              1、去掉事件内存池相关内容。 
**              2、修改 ESF_Evt_t结构体，增加变量AppendData[1]; 
**              3、修改 ESF_Cfg.h文件，使得配置功能更明了简便。
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "ESF_Tmr.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/


/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : ESF_TmrExeFuncTabCheck                                                                                                         
* 功能描述 : 定时执行功能函数表的检查                                                                                
* 输入参数 : pTmrExeFuncTab  -- 定时执行的功能函数表数组
*            FuncTabSum      -- 功能函数表数组的大小
*            TickCountBufSum -- 时间计数缓存数组的大小                                                                                      
* 返回参数 : 无                                                                 
* 补充说明 : 如果表有问题，会在该函数内死循环 while(1);                                                                                                         
************************************************************************************************************************
*/
void ESF_TmrExeFuncTabCheck(const ESF_TmrExeFunc_t *pTmrExeFuncTab, uint8_t FuncTabSum, uint8_t TickCountBufSum)
{
  uint8_t i;

  if(FuncTabSum > TickCountBufSum)
  {
    while(1);    /*数组越界，请增大TickCountBufNum值*/
  }

  for(i=1; i<FuncTabSum; i++)
  {
    if(pTmrExeFuncTab[i].pTickCount <= pTmrExeFuncTab[i-1].pTickCount)
    {
      while(1);  /*请将pTickCount变量 从小到大，无重复排列使用*/
    }   
  }
}


/*
************************************************************************************************************************
* 函数名称 : ESF_TmrExeFuncScheduling                                                                                                         
* 功能描述 : 定时执行功能函数的调度                                                                    
* 输入参数 : pTmrExeFuncTab -- 定时执行的功能函数表数组
*            FuncTabSum     -- 功能函数表数组的大小                                                                              
* 返回参数 : 无                                                                 
* 补充说明 : 1、定时执行实现原理：
*               每个定时执行的函数（pTmrExeFunc()），都有其对应的执行周期（ExePeriod）与 时间片计数值（pTickCount）。
*               该函数会将时间片计数值（pTickCount）与系统的时间计数值做比较，
*               当【系统时间计数值 - 时间片计数值（pTickCount） >= 执行周期（ExePeriod）】 时，
*               则执行相应的定时函数，并更新 时间片计数值（pTickCount）。   
*
*            2、执行周期（ExePeriod）的建议：
*               由于每个功能都有单独的时间计数值（pTickCount）。因此可以将各个功能的执行周期设置成不同的值。
*               尽量将执行周期错开，避免在同一个执行周期同时执行太多的功能。
************************************************************************************************************************
*/
void ESF_TmrExeFuncScheduling(const ESF_TmrExeFunc_t *pTmrExeFuncTab, uint8_t FuncTabSum)
{
  uint8_t i;
  Ticker_t lag;

  for(i=0; i<FuncTabSum; i++)
  {
    lag = BSP_SysTicker_CalLag(*(pTmrExeFuncTab[i].pTickCount));     /*计算时间差*/
 
    if(lag >= pTmrExeFuncTab[i].ExePeriod)                           /*时间差值 大于等于 执行周期*/
    {
      if(pTmrExeFuncTab[i].pTmrExeFunc != NULL)                      /*功能要存在*/
      {
        pTmrExeFuncTab[i].pTmrExeFunc(pTmrExeFuncTab[i].ExePeriod);  /*时间到，则执行功能*/
      }
      (*(pTmrExeFuncTab[i].pTickCount)) += lag;                      /*更新时间计数*/
    }  
  }

  /*看是否有调试信息要输出*/
  Log_OutPut();                                                      
}

