/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称：FuncMA_Led.c 
**
**    功能描述:【灯光】手动自动
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "FuncLogic.h"
#include "FuncTab.h"
#include "MChair.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                         【变量定义 & 各种声明】    
========================================================================================================================
*/


/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : MChair_LedFuncReset                                                                                               
* 功能描述 : 按摩椅 灯光功能 复位                                                               
* 输入参数 : 无                                                                                
* 返回参数 : 无                                                                                              
* 补充说明 : 无                                                           
************************************************************************************************************************
*/
void MChair_LedFuncReset(void)
{
  pMChair->LedCtrlOnOffTime = 0;
  Led_SetWorkState(FALSE);           
  Led_SetLogoWorkState(FALSE);          /*停止工作*/  
  Led_SetProjectionWorkState(FALSE);    /*停止工作*/  
}

/*
************************************************************************************************************************
* 函数名称 : MChair_FuncSwitch_LedMA                                                                                               
* 功能描述 : 按摩椅 功能切换 之  【灯光】手动自动                                                                   
* 输入参数 : SwitchMode -- 要切换模式
*            pFuncLogic -- 功能逻辑的描述                                                                                      
* 返回参数 : 无                                                                                              
* 补充说明 : 无                                                           
************************************************************************************************************************
*/
void MChair_FuncSwitch_LedMA(uint8_t SwitchMode, FuncLogic_t *pFuncLogic)
{
  LedAction_t LedActionCur;
  LedAction_t LedActionHis;

  LedActionCur.All = *pFuncLogic->pFuncCur;
  LedActionHis.All = *pFuncLogic->pFuncHis;
  if(LedActionCur.Bit.Led != LedActionHis.Bit.Led)
  {
    Led_SetWorkState(FALSE);              /*停止工作*/  
  }
  
  if(LedActionCur.Bit.Logo != LedActionHis.Bit.Logo)
  {
    Led_SetLogoWorkState(FALSE);          /*停止工作*/  
  }
  
  if(LedActionCur.Bit.Projection != LedActionHis.Bit.Projection)
  {
    Led_SetProjectionWorkState(FALSE);    /*停止工作*/  
  }
  
  MChair_LedFuncReset();
}

/*
************************************************************************************************************************
* 函数名称 : MChair_FuncExe_LedMA                                                                                               
* 功能描述 : 按摩椅 功能执行 之  【灯光】手动自动                                                                   
* 输入参数 : ExePeriod  -- 执行周期
*            pFuncLogic -- 指向自身功能逻辑的指针。                                                                                      
* 返回参数 : 无                                                                                              
* 补充说明 : 无                                                           
************************************************************************************************************************
*/
void MChair_FuncExe_LedMA(Ticker_t ExePeriod, FuncLogic_t *pFuncLogic)
{
  pMChair->ComponentFuncState.Bit.Led = FUNC_TYPE_MANNUALAUTO; /*功能状态：手动自动*/
  
  Led_SetWorkState(TRUE);  

  if(FMA_LOGO_LED_Mannual == pMChair->FuncMA_Led.Bit.Logo)
  {
    Led_SetLogoWorkState(TRUE);  
  }
  
  if(FMA_PROJECTION_LED_Mannual == pMChair->FuncMA_Led.Bit.Projection)
  {
    Led_SetProjectionWorkState(TRUE);  
    pMChair->LedCtrlOnOffTime += ExePeriod;
    if(pMChair->LedCtrlOnOffTime >= 60000)
    {
      /* disabled : projection off when timeout */
      //pMChair->FuncMA_Led.Bit.Projection = FMA_LED_NONE;       /*一分钟后关闭投影灯光*/
    }
  }
}

