/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: Core.c                                                                                                         
**
**    功能描述: 机芯驱动。管理 X Y Z TAP 四个马达。
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明: 
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "Core.h"
#include "CDP.h"

/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/
#define  PKEP                          PKEEP   

/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/
static Core_t   Core;
Core_t   *pCore = &Core;

static const  CoreXYZActionManageTabItem_t   CoreXYZActionManageTab[];

/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : Core_BackScanSetRunSw                                                                                                      
* 功能描述 : 机芯背部扫描  ——  设置运行开关                                                                 
* 输入参数 : Sw -- 开关                                                                         
* 返回参数 : 无                                                  
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_BackScanSetRunSw(uint8_t Sw)
{
  pCore->Set.Byte8.Bit.BackScanRun = Sw;
}
/*
************************************************************************************************************************
* 函数名称 : Core_ShoulderAdjustRe                                                                                                      
* 功能描述 : 机芯肩部检测重新开始                                                                
* 输入参数 : Sw -- 开关                                                                         
* 返回参数 : 无                                                  
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_ShoulderAdjustRe(void)
{
  pCore->Set.Byte9.Bit.ShoulderAdjustOp = SHOULDER_ADJUST_NONE;
}

/*
************************************************************************************************************************
* 函数名称 : Core_BackScanSetReScanCheckSw                                                                                                      
* 功能描述 : 机芯背部扫描  ——  设置重新扫描开关                                                            
* 输入参数 : Sw -- 开关                                                                         
* 返回参数 : 无                                              
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_BackScanSetReScanCheckSw(uint8_t Sw)
{
  pCore->Set.Byte8.Bit.BackScanReCheck = Sw;
  if(ON == Sw)
  {
    pCore->BackScanCSFlag.Bit.Finish = FALSE;
  }
}


/*
************************************************************************************************************************
* 函数名称 : Core_BackScanSetShoulderAdjustOp                                                                                                      
* 功能描述 : 机芯背部扫描  ——  设置肩部调节操作                                                                     
* 输入参数 : Op -   - 操作                 肩部无调节   -- SHOULDER_ADJUST_NONE    
*                                          肩部向下调节 -- SHOULDER_ADJUST_DOWN
*                                          肩部向上调节 -- SHOULDER_ADJUST_UP  
*                                          肩部调节完成 -- SHOULDER_ADJUST_FINISH  
*            KeyLS -- 按键的长短按方式     长按 -- SHOULDER_ADJUST_KEY_L
                                           短按 -- SHOULDER_ADJUST_KEY_S
* 返回参数 : SUCCESS -- 操作成功
*            FAIL    -- 操作失败                                             
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_BackScanSetShoulderAdjustOp(uint8_t Op, uint8_t KeyLS)
{
  if(FALSE == pCore->Qry.Byte9.Bit.ShoulderAdjustEn)
  {
    return FAIL;
  }
  else if(SHOULDER_ADJUST_FINISH == pCore->Set.Byte9.Bit.ShoulderAdjustOp)
  {
    return FAIL;
  }
  
  pCore->Set.Byte9.Bit.ShoulderAdjustOp = Op;
  pCore->Set.Byte9.Bit.ShoulderAdjustKeyLS = KeyLS;

  if(SHOULDER_ADJUST_UP == pCore->Set.Byte9.Bit.ShoulderAdjustOp)
  {
    if(SHOULDER_LIMIT_UP == pCore->Qry.Byte9.Bit.ShoulderLimitState)
    {
      return FAIL;
    }
  }
  else if(SHOULDER_ADJUST_DOWN == pCore->Set.Byte9.Bit.ShoulderAdjustOp)
  {
    if(SHOULDER_LIMIT_DOWN == pCore->Qry.Byte9.Bit.ShoulderLimitState)
    {
      return FAIL;
    }
  }
  else if(SHOULDER_ADJUST_FINISH == pCore->Set.Byte9.Bit.ShoulderAdjustOp)
  {
    return SUCCESS;
  }
      
  return SUCCESS;
}

/*
************************************************************************************************************************
* 函数名称 : Core_BackScanSetCurveCheckSw                                                                                                      
* 功能描述 : 机芯背部扫描  ——  设置曲线检测开关                                                                 
* 输入参数 : Sw -- 开关                                                                         
* 返回参数 : 无                                                  
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_BackScanSetCurveCheckSw(uint8_t Sw)
{
  pCore->Set.Byte9.Bit.CurveCheckSw = Sw;
}

/*
************************************************************************************************************************
* 函数名称 : Core_BackScanPauseOn                                                                                                         
* 功能描述 : 机芯背部扫描  ——  暂停                                                                         
* 输入参数 : 无                                                                                          
* 返回参数 : 无                                                                                               
* 补充说明 :                                                                                                 
************************************************************************************************************************
*/
void Core_BackScanPauseOn(void)
{
  if(pCore->BackScanCSFlag.Bit.Pause < 0x1F)
  {
    pCore->BackScanCSFlag.Bit.Pause++;
  }
}

/*
************************************************************************************************************************
* 函数名称 : Core_BackScanPauseOff                                                                                                         
* 功能描述 : 机芯背部扫描  ——  解除暂停                                                                            
* 输入参数 : 无                                                                                          
* 返回参数 : 无                                                                                               
* 补充说明 :                                                                                         
************************************************************************************************************************
*/
void Core_BackScanPauseOff(void)
{
  if(pCore->BackScanCSFlag.Bit.Pause > 0)
  {
    pCore->BackScanCSFlag.Bit.Pause--;
  }
}

/*
************************************************************************************************************************
* 函数名称 : Core_BackScanGetCSFlag                                                                                                      
* 功能描述 : 机芯背部扫描  ——  获得 控制 与 状态 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 控制与状态标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
CoreBackScanCSFlag_t Core_BackScanGetCSFlag(void)
{
  //pCore->BackScanCSFlag.Bit.Finish = TRUE;
  return pCore->BackScanCSFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Core_BackScanGetYCount                                                                                                      
* 功能描述 : 机芯背部扫描  ——  获得 当前Y计数值                                                                    
* 输入参数 : 无                                                                     
* 返回参数 : 当前Y计数值                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint16_t Core_BackScanGetYCount(void)
{
  return pCore->Qry.Byte1213.Bit.YMCountSum;
}

/*=====================================================================================================================*/
/*=====================================================================================================================*/
/*=====================================================================================================================*/
/*=====================================================================================================================*/


/*
************************************************************************************************************************
* 函数名称 : Core_SetXPosition                                                                                                         
* 功能描述 : 设置机芯 X 位置                                                                                   
* 输入参数 : Position -- 位置                                                                        
* 返回参数 : 失败--FAIL    成功--SUCCESS                                                            
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_SetXPosition(uint8_t Position)
{
  if((Position > PX_MAX) && (Position != PKEEP))
  {
    return FAIL;
  }
  
  pCore->Set.XPosition = Position;
  return SUCCESS;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetXPosition                                                                                                      
* 功能描述 : 查询机芯 X 位置                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : X位置                                                     
* 补充说明 :                                                                                                   
************************************************************************************************************************
*/
uint8_t Core_GetXPosition(void)
{
  return pCore->Qry.XPosition;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetYPosition                                                                                                      
* 功能描述 : 设置机芯 Y 位置                                                                      
* 输入参数 : Position -- 位置                                                                     
* 返回参数 : 失败--FAIL    成功--SUCCESS                                                     
* 补充说明 :                                                                                                  
************************************************************************************************************************
*/
uint8_t Core_SetYPosition(uint8_t Position)
{
  if((Position > PY_MAX) && (Position != PKEEP))
  {
    return FAIL;
  }

  pCore->Set.YPosition = Position;
  return SUCCESS;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetYPosition                                                                                                      
* 功能描述 : 查询机芯 Y 位置                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : Y位置                                                     
* 补充说明 :                                                                                                   
************************************************************************************************************************
*/
uint8_t Core_GetYPosition(void)
{
  return pCore->Qry.YPosition;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetZPosition                                                                                                      
* 功能描述 : 设置机芯 Z 位置                                                                      
* 输入参数 : Position -- 位置                                                                     
* 返回参数 : 失败--FAIL    成功--SUCCESS                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_SetZPosition(uint8_t Position)
{
  if((Position > PZ_MAX) && (Position != PKEEP))
  {
    if((Position < PZDEC15) || (Position > PZADD15))                 /*不是跟随曲线*/
    {
      return FAIL;
    }
  }

  pCore->Set.ZPosition = Position;
  return SUCCESS;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetZPosition                                                                                                      
* 功能描述 : 查询机芯 Z 位置                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : X位置                                                     
* 补充说明 :                                                                                                   
************************************************************************************************************************
*/
uint8_t Core_GetZPosition(void)
{
  return pCore->Qry.ZPosition;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetXYZPosition                                                                                                      
* 功能描述 : 设置机芯 X Y Z 位置                                                                   
* 输入参数 : XPosition -- X位置
*            YPosition -- Y位置
*            ZPosition -- Z位置                                                                          
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_SetXYZPosition(uint8_t XPosition, uint8_t YPosition, uint8_t ZPosition)
{
  Core_SetXPosition(XPosition);
  Core_SetYPosition(YPosition);
  Core_SetZPosition(ZPosition);
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetTCSActionSpeed                                                                                                      
* 功能描述 : 机芯 TCS 动作手法 的 速度                                                                      
* 输入参数 : Speed -- 速度                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_SetTCSActionSpeed(uint8_t Speed)
{
  pCore->Set.Byte3.Bit.TCSActionSpeed = Speed;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetXYZActionSpeed                                                                                                      
* 功能描述 : 机芯 XYZ动作手法 的 速度                                                                      
* 输入参数 : Speed -- 速度
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_SetXYZActionSpeed(uint8_t Speed)
{
  pCore->Set.Byte3.Bit.XYZActionSpeed = Speed;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetTCSAction                                                                                                      
* 功能描述 : 设置 TCS 动作                                                                      
* 输入参数 : ExeMode -- 执行模式。 取值：CORE_ACTION_EXE_NONE        无，上层其他使用方式，如人体检测等
*                                        CORE_ACTION_EXE_MANNNUAL    给上层手动程序使用
*                                        CORE_ACTION_EXE_AUTO        给上层自动程序使用
*            Action  -- 具体动作 取值： 参见 CoreTCSActionManageTab[] 表格的第一列。    
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void  Core_SetTCSAction(uint8_t ExeMode, uint8_t Action) 
{
  if((ExeMode != CORE_ACTION_EXE_NONE)     &&
     (ExeMode != CORE_ACTION_EXE_MANNNUAL) &&
     (ExeMode != CORE_ACTION_EXE_AUTO)     )
  {
    ExeMode = CORE_ACTION_EXE_NONE;
  }

  pCore->Set.Byte7.Bit.ActionExeMode = ExeMode;
  
  /*参数太多了，不过滤了。CoreTCSActionManageTab[]表格的管理只会执行有效动作。
    对无效的参数将执行Core_TCSActionNone()函数*/
  pCore->Set.TCSAction = Action;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetXYZAction                                                                                                      
* 功能描述 : 设置 XYZ 动作                                                                      
* 输入参数 : ExeMode -- 执行模式。 取值：CORE_ACTION_EXE_NONE        无，上层其他使用方式，如人体检测等
*                                        CORE_ACTION_EXE_MANNNUAL    给上层手动程序使用
*                                        CORE_ACTION_EXE_AUTO        给上层自动程序使用
*            Action  -- 动作  取值：参见 CoreXYZActionManageTab[] 表格的第一列。                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void  Core_SetXYZAction(uint8_t ExeMode, uint8_t Action) 
{
  if((ExeMode != CORE_ACTION_EXE_NONE)     &&
     (ExeMode != CORE_ACTION_EXE_MANNNUAL) &&
     (ExeMode != CORE_ACTION_EXE_AUTO)     )
  {
    ExeMode = CORE_ACTION_EXE_NONE;
  }
  pCore->Set.Byte7.Bit.ActionExeMode = ExeMode;

  /*参数太多了，不过滤了。CoreXYZActionManageTab[]表格的管理只会执行有效动作。
    对无效的参数将执行Core_XYZActionNone()函数*/
  pCore->Set.XYZAction = Action;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetAction                                                                                                      
* 功能描述 : 设置 机芯 动作                                                                      
* 输入参数 : ExeMode -- 执行模式。 取值：CORE_ACTION_EXE_NONE        无，上层其他使用方式，如人体检测等
*                                        CORE_ACTION_EXE_MANNNUAL    给上层手动程序使用
*                                        CORE_ACTION_EXE_AUTO        给上层自动程序使用
*            XYZAction -- 动作，取值：参见 CoreXYZActionManageTab[] 表格的第一列。    
*            TCSAction -- 动作，取值：参见 CoreTCSActionManageTab[] 表格的第一列。                                                                       
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void  Core_SetAction(uint8_t ExeMode, uint8_t XYZAction, uint8_t TCSAction) 
{
  Core_SetXYZAction(ExeMode, XYZAction); 
  Core_SetTCSAction(ExeMode, TCSAction);
}

/*
************************************************************************************************************************
* 函数名称 : Core_PauseOn                                                                                                      
* 功能描述 : 暂停机芯                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_XPauseOn(void)
{
  if(pCore->XMotorCSFlag.Bit.Pause < 0x1F)
  {
    pCore->XMotorCSFlag.Bit.Pause++;
  }
}

void Core_YPauseOn(void)
{
  if(pCore->YMotorCSFlag.Bit.Pause < 0x1F)
  {
    pCore->YMotorCSFlag.Bit.Pause++;
  }
}

void Core_ZPauseOn(void)
{
  if(pCore->ZMotorCSFlag.Bit.Pause < 0x1F)
  {
    pCore->ZMotorCSFlag.Bit.Pause++;
  }
}

void Core_TCSPauseOn(void)
{
  if(pCore->TCSMotorCSFlag.Bit.Pause < 0x1F)
  {
    pCore->TCSMotorCSFlag.Bit.Pause++;
  }
}

void Core_PauseOn(void)
{
  if(pCore->CSFlag.Bit.Pause < 0x1F)
  {
    pCore->CSFlag.Bit.Pause++;
  }
}

/*
************************************************************************************************************************
* 函数名称 : Core_PauseOff                                                                                                      
* 功能描述 : 解除暂停机芯                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_XPauseOff(void)
{
  if(pCore->XMotorCSFlag.Bit.Pause > 0)
  {
    pCore->XMotorCSFlag.Bit.Pause--;
  }
}

void Core_YPauseOff(void)
{
  if(pCore->YMotorCSFlag.Bit.Pause > 0)
  {
    pCore->YMotorCSFlag.Bit.Pause--;
  }
}

void Core_ZPauseOff(void)
{
  if(pCore->ZMotorCSFlag.Bit.Pause > 0)
  {
    pCore->ZMotorCSFlag.Bit.Pause--;
  }
}

void Core_TCSPauseOff(void)
{
  if(pCore->TCSMotorCSFlag.Bit.Pause > 0)
  {
    pCore->TCSMotorCSFlag.Bit.Pause--;
  }
}

void Core_PauseOff(void)
{
  if(pCore->CSFlag.Bit.Pause > 0)
  {
    pCore->CSFlag.Bit.Pause--;
  }
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetZMBackProtectDisableSw                                                                                                      
* 功能描述 : 设置 伸缩回退保护 失效开关                                                             
* 输入参数 : Sw -- 开关。 取值 ON  --  回退保护失效
*                              OFF --  回退保护有效
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_SetZMBackProtectDisableSw(uint8_t Sw)
{
  pCore->Set.Byte8.Bit.CoreZMBackProtectDisableSw = (ON==Sw) ? ON : OFF;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetMoveAdjustRoll                                                                                                      
* 功能描述 : 获得 手动调节机芯高度方式                                                                       
* 输入参数 : 无                                                                     
* 返回参数 : 无调节       -- CORE_MOVE_ADJUST_NONE
*            机芯向上调节 -- CORE_MOVE_ADJUST_ROLL_UP
*            机芯向下调节 -- CORE_MOVE_ADJUST_ROLL_DOWN                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_GetMoveAdjustRoll(void)
{
  return pCore->Qry.Byte7.Bit.MoveAdjustRoll;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetMoveAdjustRoll                                                                                                      
* 功能描述 : 设置 手动调节机芯高度                                                                       
* 输入参数 : RollMove    取值  无调节       -- CORE_MOVE_ADJUST_NONE
*                              机芯向上调节 -- CORE_MOVE_ADJUST_ROLL_UP
*                              机芯向下调节 -- CORE_MOVE_ADJUST_ROLL_DOWN                                                                     
* 返回参数 : SUCCESS -- 执行成功     FAIL -- 执行失败                                                                  
* 补充说明 : 无                                                                                                    
************************************************************************************************************************
*/
uint8_t Core_SetMoveAdjustRoll(uint8_t MoveAdjustRoll)
{
  if(CORE_ACTION_EXE_AUTO == pCore->CSFlag.Bit.ActionExeMode)
  {
    return FAIL;     /*自动程序时，不允许调节*/
  }

  if(FALSE == CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.ExeOp.Bit.MoveAdjustRollHandle)
  {
    return FAIL;    /*不支持手动高度调节*/
  }
  
  if((MoveAdjustRoll != CORE_MOVE_ADJUST_ROLL_UP)   &&
     (MoveAdjustRoll != CORE_MOVE_ADJUST_ROLL_DOWN) &&
     (MoveAdjustRoll != CORE_MOVE_ADJUST_NONE)      )
  {
    MoveAdjustRoll = CORE_MOVE_ADJUST_NONE;
  }  

  pCore->Set.Byte7.Bit.MoveAdjustRoll = MoveAdjustRoll;
  return SUCCESS;  
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetRollRange                                                                                                      
* 功能描述 : 获得当前的推拿(滚动)范围                                                                      
* 输入参数 : 无  
* 返回参数 : 无             -- CORE_ROLL_RANGE_NONE
*            全程推拿(滚动) -- CORE_ROLL_RANGE_WHOLE  
*            区间推拿(滚动) -- CORE_ROLL_RANGE_SPOT
*            定点推拿(滚动) -- CORE_ROLL_RANGE_PART                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_GetRollRange(void)
{
  return pCore->Qry.Byte7.Bit.RollRange;
}

/*
************************************************************************************************************************
* 函数名称 : Core_SetRollRange                                                                                                      
* 功能描述 : 设置推拿(滚动)范围                                                                      
* 输入参数 : Range 取值  无             -- CORE_ROLL_RANGE_NONE
*                        全程推拿(滚动) -- CORE_ROLL_RANGE_WHOLE
*                        区间推拿(滚动) -- CORE_ROLL_RANGE_SPOT
*                        定点推拿(滚动) -- CORE_ROLL_RANGE_PART                                                                     
* 返回参数 : SUCCESS -- 执行成功     FAIL -- 执行失败                                                                  
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_SetRollRange(uint8_t Range)
{
  if(pCore->Set.Byte7.Bit.ActionExeMode != CORE_ACTION_EXE_MANNNUAL)
  {
    return FAIL;     /*非手动*/
  }
  
  if(CORE_ROLL_RANGE_SPOT == Range) 
  {
    if((ROLL == pCore->Set.XYZAction) && 
       (pCore->Set.TCSAction > 0)     )    /*有敲击动作*/
    {
       /*手动下 敲击所伴随的行走可以定点*/
    }
    else
    {
      if(FALSE == CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.ExeOp.Bit.Spot)
      {
        return FAIL;    /*不支持定点*/
      }
    }
  }
  else if(CORE_ROLL_RANGE_PART == Range) 
  {
    if(FALSE == CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.ExeOp.Bit.Part)
    {
      return FAIL;    /*不支持区间*/
    }
  }
  else if(CORE_ROLL_RANGE_WHOLE == Range) 
  {
    if(FALSE == CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.ExeOp.Bit.Whole)
    {
      return FAIL;    /*不支持全程*/
    }
  }
  else
  {
    Range = CORE_ROLL_RANGE_NONE;
  }
  
  pCore->Set.Byte7.Bit.RollRange = Range;
  return SUCCESS;  
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetRollMoveState                                                                                                      
* 功能描述 : 获得当前的推拿(滚动)运动状态                                                                  
* 输入参数 : 无  
* 返回参数 : 没在运动     -- CORE_ROLL_MOVE_NONE
*            正在向上运动 -- CORE_ROLL_MOVE_UP  
*            正在向下运动 -- CORE_ROLL_MOVE_DOWN
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_GetRollMoveState(void)                         
{
  return pCore->Qry.Byte7.Bit.RollMoveState;
}


/*〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓*/
/*〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓*/
/*
========================================================================================================================
*           机芯XYZ动作管理表 及其相关处理函数                               机芯XYZ动作管理表 及其相关处理函数                   
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : Core_GetXYZActionRepeat                                                                                                       
* 功能描述 : 机芯 获取XYZ动作完成次数                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 完成了几次动作                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
uint8_t Core_GetXYZActionCompleteRepeat(void)
{
  return pCore->Qry.XYZActionCompleteCount;
}

/*
************************************************************************************************************************
* 函数名称 : Core_ResetXYZActionStep                                                                                                      
* 功能描述 : 复位 XYZ动作步骤                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 自动程序中如  step1 --> 定点揉捏3次
*                          step2 --> 定点揉捏5次
*            由于两个步骤中的动作并没有改变，所以不会触发动作切换操作。
*            因此 pCore->ComboCompleteCount 与步骤相关变量 就不会清零。
*            导致执行步骤 step2 时，只会揉捏2次（因为step1已经揉捏3次）。
*            所以增加此函数，自动程序步骤迭代时必须调用此函数。                                                                                                        
************************************************************************************************************************
*/
void Core_ResetXYZActionStep(void)
{
  pCore->Set.Byte3.Bit.ResetXYZActionStep = TRUE;
  pCore->Qry.XYZActionCompleteCount = 0;     /*清次收到的完成次数，等从新接收后再更新*/
}


/*====================================================================================================================*/
/*====================================================================================================================*/
static const  CoreXYZActionManageTabItem_t   CoreXYZActionManageTab[] = 
{
  /*附加操作：bit0 -- 手动 动作下，要处理手动高度调节*/

  /*动作运行标志 ：bit0 -- 向内揉捏手法 运行中           bit1 -- 向外揉捏手法 运行中 
                   bit2 -- 推拿(滚动)手法 运行中         bit3 -- 揉捏手法 运行中 
                   bit4 -- 揉抚手法 运行中               bit5 -- 揉按手法 运行中 
                   bit6 -- 指压手法 运行中               bit7 -- 伸展手法 运行中  */
  
  /*X轴最少的运动范围值。0：无范围限定； 正数：起始点向外的最少范围； 负数：起始点向内的最少范围*/ 
  /*Y轴最少的运动范围值。0：无范围限定； 正数：起始点向下的最少范围； 负数：起始点向上的最少范围*/ 
  /*Z轴最少的运动范围值。0：无范围限定； 正数：起始点向前的最少范围； 负数：起始点向后的最少范围*/ 
  /*速：动作最大可调速度档位 */
  
  /* 手动动作下使用相关      手动动作下使用相关      手动动作下使用相关
     宽：  手动动作下，最大 可调宽度。        PKEEP表示执行该动作时，该参数不可调节
     伸缩：手动动作下，最大 可调伸缩度。      PKEEP表示执行该动作时，该参数不可调节
     预Y： 手动动作下，动作执行前预定的Y位置。PKEEP表示无预定位置 
     预Z： 手动动作下，动作执行前预定的Z位置。PKEEP表示无预定位置 
     高调：手动动作下，是否要处理手动高度调节        检：  手动动作下，动作执行前是否要先人体检测
     定：  手动动作下是否支持 定点                   区：  手动动作下是否支持 区间
     全：  手动动作下是否支持 全程                   划：  是否将行程划分成若干个点
     次：  区间和全程动作在各个点位的执行次数（定点肯定是一直重复执行，区间和全程分点位执行）*/
  
  /*==============================================================================================================*/
  /*                                                                  |        手动动作下使用相关   |          */
  /* 动作                  |动作运行标志  | 运动范围  |速 | 宽 | 伸缩 |预Y  |预Z |高调,检,定,区,全,划,次  | 动作处理 */
  
  /*无按摩动作--------------------------------------------------------------------------------------------------*/
  {XYZ_ACTION_NONE,         B(00000000),   0,   0,  0, {5, PX02, PZ05, PKEP, PKEP, {1, 0, 0, 0, 0, 0, 0}},  NULL},

  /*============================================================================================================*/
  /*                 通用的手法，即不是针对特定部位的手法                                                       */
  /*============================================================================================================*/
  {KNIN,                    B(00001001),   0,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 0, 1}},  NULL},    /*向内揉捏*/
  {KNOUT,                   B(00001010),   0,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 0, 1}},  NULL},    /*向外揉捏*/
  {KNIN_VARY,               B(00001001),   0,   0,  0, {2, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*向内变速揉捏*/
  {KNOUT_VARY,              B(00001010),   0,   0,  0, {2, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*向外变速揉捏*/
  {KNIN_PUSH,               B(00001001),  -2,   0,  2, {1, PKEP, PZ05, PY14, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*向内推揉*/
  {KNOUT_PUSH,              B(00001010),  -2,  -3,  2, {1, PKEP, PZ05, PY16, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*向外推揉*/
  {KNIN_LOOP,               B(00001001),  -2,   8,  0, {1, PKEP, PZ07, PY14, PKEP, {1, 1, 1, 1, 1, 1, 1}},  NULL},    /*向内环揉*/
  {KNOUT_LOOP,              B(00001010),  -2,  -8,  0, {1, PKEP, PZ07, PY16, PKEP, {1, 1, 1, 1, 1, 1, 1}},  NULL},    /*向外环揉*/   
  {KN_3_6,                  B(00001000),  -2,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*揉捏 时钟点路径来回*/
  {KN_3_6_9,                B(00001000),  -2,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*揉捏 时钟点路径来回*/
  {KN_6_9,                  B(00001000),  -2,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*揉捏 时钟点路径来回*/
  {KN_12_9,                 B(00001000),  -2,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*揉捏 时钟点路径来回*/
  {KN_12_9_6,               B(00001000),  -2,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*揉捏 时钟点路径来回*/
  {KN_3_12_9,               B(00001000),  -2,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 1, 3}},  NULL},    /*揉捏 时钟点路径来回*/
  {ROLL,                    B(00000100),   0,   0,  0, {5, PX02, PZ07, PKEP, PKEP, {1, 1, 0, 1, 1, 0, 1}},  NULL},    /*推拿(滚动)*/
  {ROLL_KNIN,               B(00001001),   0,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 0, 1, 1, 0, 1}},  NULL},    /*推拿(滚动)+向内揉捏*/
  {ROLL_KNOUT,              B(00001010),   0,   0,  0, {5, PKEP, PZ07, PKEP, PKEP, {1, 1, 0, 1, 1, 0, 1}},  NULL},    /*推拿(滚动)+向外揉捏*/
  {ROLLUP_PUSH,             B(00000100),   0, -12,  2, {5, PX02, PZ05, PY14, PKEP, {1, 1, 1, 1, 1, 1, 1}},  NULL},    /*前顶推拿上*/
  {ROLLDOWN_PUSH,           B(00000100),   0,  12,  2, {5, PX02, PZ05, PY14, PKEP, {1, 1, 1, 1, 1, 1, 1}},  NULL},    /*前顶推拿下*/
  {Z3D_SHIA1,               B(01000000),  -2,   0,  2, {1, PKEP, PZ05, PY14, PKEP, {1, 1, 1, 1, 1, 1, 1}},  NULL},    /*Z方向3D 指压1*/
  {Z3D_SHIA2,               B(01000000),   0,   2,  2, {1, PX02, PZ05, PY14, PKEP, {1, 1, 1, 1, 1, 1, 2}},  NULL},    /*Z方向3D 指压2*/
  {SWEDISH1,                B(00000000),   0,   0,  0, {1, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 0, 1}},  NULL},    /*瑞典手法*/
  {SWEDISH2,                B(00000000),   0,   0,  0, {1, PKEP, PZ07, PKEP, PKEP, {1, 1, 1, 1, 1, 0, 1}},  NULL},    /*瑞典手法*/

  /*============================================================================================================*/
  /* 颈部、肩部、腰部、背部、臀部等类型的手法 不一定只作用在固定的部位。 这些手法手动时执行大部分只能定点或区间 *
   * 例如 颈部揉捏 可以作用在任何部位。具体的作用部位由程序根据需要进行控制。                                   *
   * 但一般在该部位执行该手法的按摩效果会比较好。即这种特定部位的手法，比较有针对性。                           */
  /*============================================================================================================*/
  /*按摩动作 颈部-----------------------------------------------------------------------------------------------*/
  {NECK_ROLL1,              B(00000100),   2,  -7,  3, {1, PKEP, PZ04, PY02, PZ01, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*颈部推拿上(滚动)*/
  {NECK_KNEAD1,             B(00001000),  -2,  -6, -2, {1, PKEP, PZ07, PY02, PZ04, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*颈部揉捏1*/
  {NECK_KNEADSTROKE1,       B(00010000),  -2,  -9,  2, {3, PKEP, PZ05, PY02, PZ03, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*颈部揉抚1*/
  {NECK_KNEADPRESS1,        B(00100000),  -2,  -8,  2, {1, PKEP, PZ05, PY02, PZ03, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*颈部揉按1*/
//  {NECK_SHIA1,              B(01000000),  -2,  -6,  2, {1, PKEP, PZ03, PY04, PKEP, {1, 1, 1, 0, 0, 1, 1}},  NULL},  /*颈部指压1*/

  /*按摩动作 肩部---------------------------------------------------------------------------------------------*/
  {SHOULDER_ROLL1,          B(00000100),   2,  10,  0, {1, PKEP, PZ07, PY08, PZ02, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*肩部推拿(滚动)1*/
  {SHOULDER_KNEAD1,         B(00001000),  -2,   5,  0, {1, PKEP, PZ07, PY05, PZ03, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*肩部揉捏1*/
  {SHOULDER_KNEADSTROKE1,   B(00010000),  -2,  -8,  0, {3, PKEP, PZ07, PY07, PZ03, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*肩部揉抚1*/
  {SHOULDER_KNEADPRESS1,    B(00100000),   2,  12,  1, {1, PKEP, PZ06, PY07, PZ01, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*肩部揉按1*/
  {SHOULDER_SHIA1,          B(01000000),  -2,   3,  2, {1, PKEP, PZ05, PY04, PZ03, {1, 1, 1, 0, 0, 1, 1}},  NULL},    /*肩部指压1*/

  /*按摩动作 背部----------------------------------------------------------------------------------------------*/
  {BACK_ROLLUP,             B(00000100),   0,  -9,  1, {4, PX02, PZ06, PY16, PZ02, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部推拿(滚动)1*/
  {BACK_ROLLDOWN,           B(00000100),   0,   9,  1, {4, PX02, PZ06, PY12, PZ02, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部推拿(滚动)1*/
  {BACK_KNEAD1,             B(00001000),  -2,  -8,  0, {4, PKEP, PZ07, PY17, PZ02, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部揉捏1*/
  {BACK_KNEAD2,             B(00001000),  -2,   8,  0, {4, PKEP, PZ07, PY14, PZ02, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部揉捏1*/
  {BACK_KNEADSTROKE1,       B(00010000),  -2, -13,  0, {1, PKEP, PZ07, PY17, PZ02, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部揉抚1*/
  {BACK_KNEADPRESS1,        B(00100000),  -2,   9,  1, {1, PKEP, PZ06, PY13, PZ01, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部揉按1*/
  {BACK_KNEADPRESS2,        B(00100000),  -2,   8,  1, {1, PKEP, PZ06, PY13, PZ01, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部揉按2*/
  {BACK_SHIA1,              B(01000000),  -2,   9,  2, {1, PKEP, PZ05, PY14, PZ01, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*背部指压1*/

  /*按摩动作 腰部-----------------------------------------------------------------------------------------------*/
  {LUMBAR_ROLLUP,           B(00000100),   0, -12,  2, {4, PX02, PZ05, PY22, PZ03, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部推拿上(滚动)*/
  {LUMBAR_ROLLDOWN,         B(00000100),   0,  12,  2, {4, PX02, PZ05, PY17, PZ03, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部推拿下(滚动)*/
  {LUMBAR_KNEAD1,           B(00001000),  -2,  -8,  0, {4, PKEP, PZ07, PY21, PZ04, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部揉捏1*/
  {LUMBAR_KNEAD2,           B(00001000),  -2,   8,  0, {4, PKEP, PZ07, PY18, PZ04, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部揉捏2*/
  {LUMBAR_KNEADSTROKE1,     B(00010000),  -2,  13,  0, {1, PKEP, PZ07, PY17, PZ04, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部揉抚1*/
  {LUMBAR_KNEADPRESS1,      B(00100000),  -2,  -8,  1, {1, PKEP, PZ06, PY20, PZ03, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部揉按1*/
  {LUMBAR_KNEADPRESS2,      B(00100000),  -2,  -8,  1, {1, PKEP, PZ06, PY20, PZ03, {1, 1, 1, 1, 0, 1, 1}},  NULL},    /*腰部揉按2*/
  {LUMBAR_SHIA1,            B(01000000),  -2,  -9,  2, {1, PKEP, PZ05, PY20, PZ03, {1, 1, 1, 1, 0, 1, 1}},  NULL}     /*腰部指压1*/

  /*按摩动作 全身-----------------------------------------------------------------------------------------------*/
//  {BODY_ROLL1,              B(00000100),   0,   0,  0, {1, PX02, PZ05, PY00, PKEP, {0, 1, 0, 0, 1, 0, 1}},  NULL},  /*全身推拿(滚动)1*/
//  {BODY_KNEAD1,             B(00001000),   0,   0,  0, {1, PKEP, PZ05, PY00, PKEP, {0, 1, 0, 0, 1, 0, 1}},  NULL},  /*全身揉捏1*/
//  {BODY_KNEADSTROKE1,       B(00010000),   0,   0,  0, {1, PKEP, PZ05, PY00, PKEP, {0, 1, 0, 0, 1, 0, 1}},  NULL},  /*全身揉抚1*/
//  {BODY_KNEADPRESS1,        B(00100000),   0,   0,  0, {1, PKEP, PZ05, PY00, PKEP, {0, 1, 0, 0, 1, 0, 1}},  NULL},  /*全身揉按1*/
//  {BODY_SHIA1,              B(01000000),   0,   0,  0, {1, PKEP, PZ05, PY00, PKEP, {0, 1, 0, 0, 1, 0, 1}},  NULL}   /*全身指压1*/
};

#define  CORE_XYZ_ACTION_TAB_NUM    TAB_NUM(CoreXYZActionManageTab)

static uint16_t Core_GetXYZActionID(uint16_t index)
{
  if(index > (CORE_XYZ_ACTION_TAB_NUM-1))
  {
    return INDEX_NO_MATCH;
  }
  return CoreXYZActionManageTab[index].ActionID;
}

/*
************************************************************************************************************************
* 函数名称 : Core_XYZActionHandle                                                                                                      
* 功能描述 : 机芯 XYZ按摩动作 处理                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 使用表格对动作进行逻辑管理                                                                                                       
************************************************************************************************************************
*/
void Core_XYZActionHandle(Ticker_t ExePeriod)
{
  uint8_t i;
  static uint8_t XYZActionHis = 0xff;
  static uint8_t ActionExeModeHis = 0;
  const static uint8_t RollRangeValBuf[] = 
  {
    CORE_ROLL_RANGE_WHOLE, CORE_ROLL_RANGE_SPOT, CORE_ROLL_RANGE_PART//, CORE_ROLL_RANGE_NONE
  };
  
  if(pCore->CSFlag.Bit.Pause > 0)
  {
    return;                                                                                /*机芯暂停，则不执行动作处理*/
  }

  /*有动作切换 或 动作执行模式切换----------------------------------------------------------------*/
  if((XYZActionHis     != pCore->Set.XYZAction)              ||
     (ActionExeModeHis != pCore->Set.Byte7.Bit.ActionExeMode))
  {
    XYZActionHis = pCore->Set.XYZAction;
    ActionExeModeHis = pCore->Set.Byte7.Bit.ActionExeMode;
    
    Core_ResetXYZActionStep();                                                             /*复位XYZ动作的步骤*/
  
    /*在表格中搜索要执行的动作条目*/
    pCore->XYZActionIndex = BinarySearch(pCore->Set.XYZAction, CORE_XYZ_ACTION_TAB_NUM, Core_GetXYZActionID);
    if(INDEX_NO_MATCH == pCore->XYZActionIndex)                                            /*动作参数无效*/
    {
      pCore->XYZActionIndex = 0;                                                           /*动作无效，则转入空动作的处理*/
    }

    pCore->Set.Byte7.Bit.MoveAdjustRoll = CORE_MOVE_ADJUST_NONE;                           /*切换动作时，关闭机芯的上下长按调节*/
    if((XYZ_ACTION_NONE      == pCore->Set.XYZAction)              ||                      /*切换到无动作*/
       (CORE_ACTION_EXE_AUTO == pCore->Set.Byte7.Bit.ActionExeMode))                       /*自动程序下 的 动作切换*/
    {
      pCore->Set.Byte3.Bit.XYZActionSpeed = XYZ_ACTION_DEFAULT_SPPED;                      /*切换到无动作时，恢复默认速度参数*/
      pCore->Set.Byte7.Bit.RollRange = CORE_ROLL_RANGE_NONE;                               /*切换到无动作时，关闭定点、区间、全程*/
    }
    
    if(CORE_ACTION_EXE_MANNNUAL == pCore->Set.Byte7.Bit.ActionExeMode)                     /*手动程序下*/
    {
      if(CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.YPrePosition != PKEEP)      /*需要先运动到预定的执行位置*/
      {
        pCore->Set.YPosition = CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.YPrePosition;         
        pCore->Set.Byte7.Bit.RollRange = CORE_ROLL_RANGE_SPOT;                             /*有预定Y位置的，先转为定点执行*/
      }
      
      if((CORE_ROLL_RANGE_NONE == pCore->Set.Byte7.Bit.RollRange) ||                          
         (FAIL == Core_SetRollRange(pCore->Set.Byte7.Bit.RollRange)))                          
      { /*每个手法都有其属性以判断是否支持手动下的定点、区间、全程。手法切换时，应该判断当前手法是否支持目前的 RollRange值。
          先用当前的设置值(非CORE_ROLL_RANGE_NONE)自我设置，若失败，表面该动作不支持当前的RollRange值。则使用RollRangeValBuf数组的值，一个个尝试*/
        for(i=0; i<TAB_NUM(RollRangeValBuf); i++)
        {
          if(SUCCESS == Core_SetRollRange(RollRangeValBuf[i]))
          {
            break;
          }
        }
      }
    }  
  }
  
  /*动作执行前的补充处理--------------------------------------------------------------------------*/
  if(pCore->Set.Byte3.Bit.XYZActionSpeed > CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.SpeedMax)      
  {
    pCore->Set.Byte3.Bit.XYZActionSpeed = CoreXYZActionManageTab[pCore->XYZActionIndex].Mannual.SpeedMax;       /*修正动作速度最大值*/
  }
  if(CORE_ACTION_EXE_MANNNUAL == pCore->Set.Byte7.Bit.ActionExeMode)                     /*手动程序下*/
  {                                                                                        
  }
  else
  {
    pCore->Set.Byte7.Bit.RollRange = CORE_ROLL_RANGE_NONE;                               /*非手动程序使用，关闭定点、区间、全程*/
  }

  /*执行动作------------------------------------------------------------------------------*/
  pCore->ActionRunFlag.Bit.XYZ.All = CoreXYZActionManageTab[pCore->XYZActionIndex].ActionRunFlag.All;
  
  /*动作执行后的补充处理--------------------------------------------------------------------------*/
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetXYZMannualManageAttr                                                                                               
* 功能描述 : 机芯 获得手动程序下管理的属性                                                                               
* 输入参数 : XYZAction -- 要查询的XYZ动作 
*            pAttr     -- 指向要保存查询数据的地址 
* 返回参数 : 失败--FAIL    成功--SUCCESS                                                     
* 补充说明 : 无                                                           
************************************************************************************************************************
*/
uint8_t Core_GetXYZMannualManageAttr(uint8_t XYZAction, CoreXYZMannualArrt_t *pAttr)
{
  uint16_t index;

  index = BinarySearch(XYZAction, CORE_XYZ_ACTION_TAB_NUM, Core_GetXYZActionID);
  if(INDEX_NO_MATCH == index)                                            /*动作参数无效*/
  {
    return FAIL; 
  }
  
  memcpy(pAttr, &CoreXYZActionManageTab[index].Mannual, sizeof(CoreXYZMannualArrt_t));
  return SUCCESS; 
}

/*〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓*/
/*
========================================================================================================================
*           机芯TCS动作管理表 及其相关处理函数                            机芯TCS动作管理表 及其相关处理函数
========================================================================================================================
*/
/*=====================================================================================================================*/
/*=====================================================================================================================*/
static const  CoreTCSActionManageTabItem_t   CoreTCSActionManageTab[] = 
{
  /*动作运行标志 ：bit0 -- 拍打1手法  运行中         bit1 -- 拍打2手法 运行中 
                   bit2 -- 指压1手法 运行中          bit3 -- 指压2手法 运行中 
                   bit4 -- 轻敲击手法 运行中         bit5 -- 敲击手法 运行中  */
  
  /*   动作                 动作运行标志  附加操作         动作的执行处理          */

  /*无按摩动作------------------------------------------------------------------*/
  {TCS_ACTION_NONE,         B(00000000), B(00000000),   NULL},
  {CLAP1,                   B(00000001), B(00000000),   NULL},           /*拍打1*/       
  {CLAP2,                   B(00000010), B(00000000),   NULL},           /*拍打2*/ 
  {SHIA1,                   B(00000100), B(00000000),   NULL},           /*指压1*/ 
  {SHIA2,                   B(00001000), B(00000000),   NULL},           /*指压2*/ 
  {LTAP,                    B(00010000), B(00000000),   NULL},           /*轻敲击*/ 
  {TAP,                     B(00100000), B(00000000),   NULL},           /*敲击*/ 
  {NO_FB_LTAP,              B(00010000), B(00000000),   NULL},           /*无反馈轻敲击*/ 
  {NO_FB_TAP,               B(00100000), B(00000000),   NULL},           /*无反馈敲击*/ 
  
  {XYZ_CLAP1,               B(00000001), B(00000000),   NULL},           /*伴随拍打1*/       
  {XYZ_CLAP2,               B(00000010), B(00000000),   NULL},           /*伴随拍打2*/ 
  {XYZ_SHIA1,               B(00000100), B(00000000),   NULL},           /*伴随指压1*/ 
  {XYZ_SHIA2,               B(00001000), B(00000000),   NULL},           /*伴随指压2*/ 
  {XYZ_LTAP,                B(00010000), B(00000000),   NULL},           /*伴随轻敲击*/ 
  {XYZ_TAP,                 B(00100000), B(00000000),   NULL},           /*伴随敲击*/ 
  {XYZ_NO_FB_LTAP,          B(00010000), B(00000000),   NULL},           /*伴随无反馈轻敲击*/ 
  {XYZ_NO_FB_TAP,           B(00100000), B(00000000),   NULL},           /*伴随无反馈敲击*/
  {XYZ_D_TCS,               B(00010000), B(00000000),   NULL}            /*伴随默认的TCS动作*/
};

#define  CORE_TCS_ACTION_TAB_NUM    TAB_NUM(CoreTCSActionManageTab)

static uint16_t Core_GetTCSActionID(uint16_t index)
{
  if(index > (CORE_TCS_ACTION_TAB_NUM-1))
  {
    return INDEX_NO_MATCH;
  }
  return CoreTCSActionManageTab[index].ActionID;
}

/*
************************************************************************************************************************
* 函数名称 : Core_TCSActionHandle                                                                                                      
* 功能描述 : 机芯 TCS按摩动作 处理                                                                      
* 输入参数 : ExePeriod -- 执行周期                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 使用表格对动作进行逻辑管理                                                                                                       
************************************************************************************************************************
*/
void Core_TCSActionHandle(Ticker_t ExePeriod)
{
  static uint8_t TCSActionHis = 0xff;

  if(pCore->CSFlag.Bit.Pause > 0)
  {
    return;                                                   /*机芯暂停，则不执行动作处理*/
  }

  /*有动作切换-------------------------------------------------*/
  if(TCSActionHis != pCore->Set.TCSAction)
  {
    TCSActionHis = pCore->Set.TCSAction;
    
    /*在表格中搜索要执行的动作条目*/
    pCore->TCSActionIndex = BinarySearch(pCore->Set.TCSAction, CORE_TCS_ACTION_TAB_NUM, Core_GetTCSActionID);
    if(INDEX_NO_MATCH == pCore->TCSActionIndex)               /*动作参数无效*/
    {
      pCore->TCSActionIndex = 0;                              /*动作无效，则转入空动作的处理*/
    }
    
    if(TCS_ACTION_NONE == pCore->Set.TCSAction)               /*切换到无动作*/
    {
      pCore->Set.Byte3.Bit.TCSActionSpeed = TCS_DEFAULT_SPPED;       /*切换到无动作时，恢复默认速度参数*/
    }
  } 

  /*执行动作---------------------------------------------------*/
  pCore->ActionRunFlag.Bit.TCS.All = CoreTCSActionManageTab[pCore->TCSActionIndex].ActionRunFlag.All;
}


/*〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓*/
/*〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓*/
/*
========================================================================================================================
*       机芯功能函数管理表                       机芯功能函数管理表                      机芯功能函数管理表
========================================================================================================================
*/
#define  CORE_TICK_COUNT_BUF_NUM   4
static Ticker_t Core_TickCount[CORE_TICK_COUNT_BUF_NUM];

static const ESF_TmrExeFunc_t  Core_TmrExeFuncTab[] = 
{
  /*   执行函数                 执行周期     时间计数变量*/

  /*机芯按摩手法动作逻辑处理相关------------------------------------------*/
  {Core_XYZActionHandle,           19,      &Core_TickCount[0]},      /*XYZ动作逻辑处理*/ 
  {Core_TCSActionHandle,           50,      &Core_TickCount[1]}       /*TCS动作逻辑处理*/ 
};

#define  CORE_TMR_EXE_FUNC_TAB_NUM     TAB_NUM(Core_TmrExeFuncTab)

/*
************************************************************************************************************************
* 函数名称 : Core_Handle                                                                                                      
* 功能描述 : 机芯 处理                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 无                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
void Core_Handle(void)
{
  /*调度功能函数表------------------------------------------------*/
  ESF_TmrExeFuncScheduling(Core_TmrExeFuncTab, CORE_TMR_EXE_FUNC_TAB_NUM);
}

/*
************************************************************************************************************************
* 函数名称 : Core_Init                                                                                                      
* 功能描述 : 机芯 初始化                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 返回 可操作机芯功能 的结构体 的指针                                                    
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
Core_t* Core_Init(void)
{
  uint8_t i;

  /*初始化相关数据----------------------------------------------*/
  memset(pCore, 0, sizeof(Core_t)); /*清零所有数据*/
  pCore->CSFlag.Bit.RollRange      = CORE_ROLL_RANGE_NONE;
  pCore->CSFlag.Bit.MoveAdjustRoll = CORE_MOVE_ADJUST_NONE;
  pCore->Set.XYZAction = CORE_ACTION_NONE;
  pCore->Set.TCSAction = CORE_ACTION_NONE;
  pCore->Set.XPosition = PX_MAX;
  pCore->Set.YPosition = PY_MIN;
  pCore->Set.ZPosition = PZ_MIN;
  pCore->Set.Byte3.Bit.ResetXYZActionStep = TRUE;   

  /*检测CoreXYZActionManageTab 表格排列是否正确------------------------------*/
  for(i=1; i<TAB_NUM(CoreXYZActionManageTab); i++)
  {
    if(CoreXYZActionManageTab[i].ActionID <= CoreXYZActionManageTab[i-1].ActionID)
    {
      while(1);  /*请将ActionID 从小到大，无重复排列使用*/
    }   
  }
  /*检测CoreTCSActionManageTab 表格排列是否正确------------------------------*/
  for(i=1; i<TAB_NUM(CoreTCSActionManageTab); i++)
  {
    if(CoreTCSActionManageTab[i].ActionID <= CoreTCSActionManageTab[i-1].ActionID)
    {
      while(1);  /*请将ActionID 从小到大，无重复排列使用*/
    }   
  }
  /*检测 Core_TmrExeFuncTab 功能函数表排列是否正确---------------------------*/
  ESF_TmrExeFuncTabCheck(Core_TmrExeFuncTab, CORE_TMR_EXE_FUNC_TAB_NUM, CORE_TICK_COUNT_BUF_NUM);

  return pCore;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetCSFlag                                                                                                      
* 功能描述 : 获得 控制 与 状态 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 控制与状态标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
CoreCSFlag_t Core_GetCSFlag(void)
{
  return pCore->CSFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetActionRunFlag                                                                                                      
* 功能描述 : 获得 动作运行 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 动作运行标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
CoreActionRunFlag_t Core_GetActionRunFlag(void)
{
  return pCore->ActionRunFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetXMotorState                                                                                                      
* 功能描述 : 获得 马达状态 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 状态标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
XMotorCSFlag_t Core_GetXMotorState(void)
{
  return pCore->XMotorCSFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetYMotorState                                                                                                      
* 功能描述 : 获得 马达状态 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 状态标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
YMotorCSFlag_t Core_GetYMotorState(void)
{
  return pCore->YMotorCSFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetZMotorState                                                                                                      
* 功能描述 : 获得 马达状态 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 状态标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
ZMotorCSFlag_t Core_GetZMotorState(void)
{
  return pCore->ZMotorCSFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Core_GetTCSMotorState                                                                                                      
* 功能描述 : 获得 马达状态 标识                                                                      
* 输入参数 : 无                                                                     
* 返回参数 : 状态标识 的结构体                                                     
* 补充说明 : 无                                                                                                       
************************************************************************************************************************
*/
TCSMotorCSFlag_t Core_GetTCSMotorState(void)
{
  return pCore->TCSMotorCSFlag;
}


/*
************************************************************************************************************************
* 函数名称 : Core_CDPDataObjRx_0x40                                                                                      
* 功能描述 : 0x40 机芯手法控制(中心板<-->机芯板）：应用于 中心板和机芯板单独布板的系统，且机芯板实现成一个独立的逻辑模块。                                                                              
* 输入参数 : pRxDU   -- 指向接收的数据对象单元
*            pAckDU  -- 指向应答的数据对象单元
*            SrcAddr -- 数据的来源
*            Cmd     -- 命令
* 返回参数 : 处理成功：该数据对象的长度    
             处理出错：CDP_DU_HANDLE_ERR 数据处理出错
* 补充说明 : 无
************************************************************************************************************************
*/
uint8_t Core_CDPDataObjRx_0x40(uint8_t *pRxDU, uint8_t *pAckDU, uint8_t SrcAddr, uint8_t Cmd)
{
  /*更新数据到中心板-------------------------------------------------------------*/
  memcpy((uint8_t *)&pCore->Qry, &pRxDU[CDP_DU_OFFSET_LEN], sizeof(pCore->Qry));
  
  if(TRUE == pCore->Set.Byte3.Bit.ResetXYZActionStep)                                     /*步骤复位有效时，则完成次数先一直清零*/
  {
    pCore->Qry.XYZActionCompleteCount = 0;    
  }
  if(pCore->Qry.Byte3.Bit.ResetXYZActionStep == pCore->Set.Byte3.Bit.ResetXYZActionStep)  /*收到机芯板的为TRUE，表明机芯板已经收到且开启了复位*/
  {
    pCore->Set.Byte3.Bit.ResetXYZActionStep = FALSE;                                      /*清除，防止一直有效*/
  }
  
  if(TRUE == pCore->Set.Byte8.Bit.BackScanReCheck)                                        /*重新扫描开关有效时，则完成标志先一直清零*/
  {
    pCore->Qry.Byte8.Bit.BackScanFinish = FALSE;
  }
  if(pCore->Qry.Byte8.Bit.BackScanReCheck == pCore->Set.Byte8.Bit.BackScanReCheck)        /*收到机芯板的为TRUE，表明机芯板已经收到且开启了相关操作*/
  {
    pCore->Set.Byte8.Bit.BackScanReCheck = FALSE;                                         /*清除，防止一直有效*/
  }
  
  #if (SHOULDER_ADJUST_KEY_S == SHOULDER_ADJUST_KEY_LSMODE)                               /*肩部调节为点按*/
  if(pCore->Qry.Byte9.Bit.ShoulderAdjustOp == pCore->Set.Byte9.Bit.ShoulderAdjustOp)      /*相等则表示机芯板已经收到且开启了相关操作*/
  {
    pCore->Set.Byte9.Bit.ShoulderAdjustOp = SHOULDER_ADJUST_NONE;                         /*清除，防止一直有效*/
  }
  #endif
  
  pCore->CSFlag.Bit.RollRange      = pCore->Qry.Byte7.Bit.RollRange;
  pCore->CSFlag.Bit.MoveAdjustRoll = pCore->Qry.Byte7.Bit.MoveAdjustRoll;
  pCore->CSFlag.Bit.ActionExeMode  = pCore->Qry.Byte7.Bit.ActionExeMode;
 
  pCore->BackScanCSFlag.Bit.Finish             = pCore->Qry.Byte8.Bit.BackScanFinish;
  pCore->BackScanCSFlag.Bit.NoHumanOnSeat      = pCore->Qry.Byte8.Bit.BackScanNoHumanOnSeat;
  pCore->BackScanCSFlag.Bit.ShoulderAdjustEn   = pCore->Qry.Byte9.Bit.ShoulderAdjustEn;
  pCore->BackScanCSFlag.Bit.ShoulderLimitState = pCore->Qry.Byte9.Bit.ShoulderLimitState;
  pCore->BackScanCSFlag.Bit.CurveReceived      = pCore->Qry.Byte9.Bit.CurveReceived;

  pCore->XMotorCSFlag.Bit.Work                = pCore->Qry.Byte15.Bit.XMotorWork;
  pCore->XMotorCSFlag.Bit.PositionResetOK     = pCore->Qry.Byte15.Bit.XPositionResetOK;
  pCore->XMotorCSFlag.Bit.PositionSensorFault = pCore->Qry.Byte15.Bit.XPositionSensorFault;
  pCore->XMotorCSFlag.Bit.PositionCodeFault   = pCore->Qry.Byte15.Bit.XPositionCodeFault;
  pCore->XMotorCSFlag.Bit.RPMSensorFault      = pCore->Qry.Byte15.Bit.XRPMSensorFault;
  pCore->XMotorCSFlag.Bit.OverCurrentFault    = pCore->Qry.Byte15.Bit.XOverCurrentFault;
  pCore->YMotorCSFlag.Bit.Work                = pCore->Qry.Byte16.Bit.YMotorWork;
  pCore->YMotorCSFlag.Bit.PositionResetOK     = pCore->Qry.Byte16.Bit.YPositionResetOK;
  pCore->YMotorCSFlag.Bit.PositionSensorFault = pCore->Qry.Byte16.Bit.YPositionSensorFault;
  pCore->YMotorCSFlag.Bit.PositionCodeFault   = pCore->Qry.Byte16.Bit.YPositionCodeFault;
  pCore->YMotorCSFlag.Bit.RPMSensorFault      = pCore->Qry.Byte16.Bit.YRPMSensorFault;
  pCore->YMotorCSFlag.Bit.OverCurrentFault    = pCore->Qry.Byte16.Bit.YOverCurrentFault;
  pCore->ZMotorCSFlag.Bit.Work                = pCore->Qry.Byte17.Bit.ZMotorWork;
  pCore->ZMotorCSFlag.Bit.PositionResetOK     = pCore->Qry.Byte17.Bit.ZPositionResetOK;
  pCore->ZMotorCSFlag.Bit.PositionSensorFault = pCore->Qry.Byte17.Bit.ZPositionSensorFault;
  pCore->ZMotorCSFlag.Bit.PositionCodeFault   = pCore->Qry.Byte17.Bit.ZPositionCodeFault;
  pCore->ZMotorCSFlag.Bit.RPMSensorFault      = pCore->Qry.Byte17.Bit.ZRPMSensorFault;
  pCore->ZMotorCSFlag.Bit.OverCurrentFault    = pCore->Qry.Byte17.Bit.ZOverCurrentFault;
  pCore->TCSMotorCSFlag.Bit.Work              = pCore->Qry.Byte18.Bit.TCSMotorWork;
  pCore->TCSMotorCSFlag.Bit.RPMSensorFault    = pCore->Qry.Byte18.Bit.TCSRPMSensorFault;
  pCore->TCSMotorCSFlag.Bit.OverCurrentFault  = pCore->Qry.Byte18.Bit.TCSOverCurrentFault;
  
  return pRxDU[CDP_DU_OFFSET_LEN];
}

/*
************************************************************************************************************************
* 函数名称 : Core_CDPDataObjTx_0x40                                                                                      
* 功能描述 : 0x40 机芯手法控制(中心板<-->机芯板）：应用于 中心板和机芯板单独布板的系统，且机芯板实现成一个独立的逻辑模块。                                                                             
* 输入参数 : 无
* 返回参数 : 成功则返回要发送的数据的内存首地址，失败返回NULL空指针
* 补充说明 : 无
************************************************************************************************************************
*/
uint8_t* Core_CDPDataObjTx_0x40(void)
{
//  static uint8_t CurveTab[] = 
//  { /*人体曲线数量根据导轨的长度的不同而不同，因此单独声明一块空间来存放，
//      而不使用pCore->Set的内存空间，避免人体曲线数量过多，而pCore->Set空间存放不下，造成野指针操作*/
//    0x02+0x03,                                                    //长度临时值，会根据实际数组大小进行改写
//    0x40,                                                         //ID
//    0xFF, 0xFE, 0xFD,                                             //3字节的识别
//    PZ03,  PZ04,  PZ04,  PZ04,  PZ04,  PZ04,  PZ03,  PZ03,        //0~7
//    PZ02,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02,        //8~15
//    PZ02,  PZ02,  PZ03,  PZ03,  PZ04,  PZ04,  PZ04,  PZ04,        //16~23
//    PZ04,  PZ01,  PZ01,  PZ01,  PZ01,  PZ02,  PZ02,  PZ02,  PZ02  //24~32
//  };
  static uint8_t CurveTab[] = 
  { /*人体曲线数量根据导轨的长度的不同而不同，因此单独声明一块空间来存放，
      而不使用pCore->Set的内存空间，避免人体曲线数量过多，而pCore->Set空间存放不下，造成野指针操作*/
    0x02+0x03,                                                    //长度临时值，会根据实际数组大小进行改写
    0x40,                                                         //ID
    0xFF, 0xFE, 0xFD,                                             //3字节的识别
    PZ03,  PZ04,  PZ04,  PZ04,  PZ04,  PZ04,  PZ03,  PZ02,        //0~7
    PZ02,  PZ02,  PZ02,  PZ02,  PZ01,  PZ01,  PZ02,  PZ02,        //8~15
    PZ02,  PZ02,  PZ02,  PZ02,  PZ03,  PZ03,  PZ04,  PZ04,        //16~23
    PZ04,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02,  PZ02  //24~32
  };
  
  if(FALSE == pCore->BackScanCSFlag.Bit.CurveReceived)        /*传送曲线数据给机芯板*/
  {
    CurveTab[0] = TAB_NUM(CurveTab);                          /*修改实际的数据长度*/
    return CurveTab;
  }
  else   /*常规数据处理*/
  {
    pCore->Set.Byte8.Bit.CorePause         = (pCore->CSFlag.Bit.Pause > 0)         ? TRUE : FALSE;
    pCore->Set.Byte8.Bit.CoreBackScanPause = (pCore->BackScanCSFlag.Bit.Pause > 0) ? TRUE : FALSE;

    pCore->Set.Byte10.Bit.YMTOPLimtCode          = YMOTOR_TOP_LIMIT_CODE;
    pCore->Set.Byte10.Bit.YMBOTLimtCode          = YMOTOR_BOT_LIMIT_CODE;
    pCore->Set.YMPositionMax                     = PYM_MAX;
    pCore->Set.Byte1213.Bit.YMCountSum           = YMOTOR_COUNT_MAX; 
    pCore->Set.Byte1213.Bit.CountNocalibrationSw = 0;
    pCore->Set.Byte1213.Bit.YMPositionResetAt    = CORE_YPOSITION_RESET_TOP;
    pCore->Set.YPositionMax                      = PY_MAX;
    
    pCore->Set.Byte15.Bit.XMotorPause   = (pCore->XMotorCSFlag.Bit.Pause > 0)   ? TRUE : FALSE;
    pCore->Set.Byte16.Bit.YMotorPause   = (pCore->YMotorCSFlag.Bit.Pause > 0)   ? TRUE : FALSE;
    pCore->Set.Byte17.Bit.ZMotorPause   = (pCore->ZMotorCSFlag.Bit.Pause > 0)   ? TRUE : FALSE;
    pCore->Set.Byte18.Bit.TCSMotorPause = (pCore->TCSMotorCSFlag.Bit.Pause > 0) ? TRUE : FALSE;

    pCore->Set.DataLen = sizeof(pCore->Set);
    pCore->Set.DataID  = 0x40;  
    return (uint8_t *)&pCore->Set;
  }
}
