/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: Gas.c                                                                                                         
**
**    功能描述: 气泵、气囊驱动。
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "Gas.h"
#include "ESF.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/
static Gas_t   Gas;
Gas_t   *pGas = &Gas;

//static uint8_t  CalvesPressure[6] = {0, 7, 10, 14, 19, 26};
static uint8_t  CalvesPressure[6] = {0, 4, 7, 10, 13, 16};

/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : Gas_SetCalvesPressureThreshold                                                                                                         
* 功能描述 : 设置腿部气压门限值                                                                                    
* 输入参数 : GasItensity -- 充气强度                                                                                    
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_SetCalvesPressureThreshold(uint8_t GasIntensity)
{
  GasIntensity = (GasIntensity > 5) ? 5 : GasIntensity;
  pGas->CalvesPressureThresholdSet = CalvesPressure[GasIntensity];
}


/*
************************************************************************************************************************
* 函数名称 : Gas_PauseOn                                                                                                         
* 功能描述 : 暂停充气                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_PauseOn(void)
{
  if(pGas->CSFlag.Bit.Pause < 0x1F)
  {
    pGas->CSFlag.Bit.Pause++;
  }
}

/*
************************************************************************************************************************
* 函数名称 : Gas_PauseOff                                                                                                         
* 功能描述 : 解除暂停                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_PauseOff(void)
{
  if(pGas->CSFlag.Bit.Pause > 0)
  {
    pGas->CSFlag.Bit.Pause--;
  }
}

/*
************************************************************************************************************************
* 函数名称 : Gas_GetGasPart1                                                                                                         
* 功能描述 : 获得充气部位1                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : GasPart1  --    b0    SeatSide           座侧 
*                            b1    LumbarSide         腰侧
*                            b2    ArmsRF             右手臂前
*                            b3    ArmsRB             右手臂后
*                            b4    ArmsLF             左手臂前
*                            b5    ArmsLB             左手臂后
*                            b6    ShoulderSide       肩侧
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
GasPart1_t Gas_GetGasPart1(void)
{
  return pGas->GasPart.Part1;
}

/*
************************************************************************************************************************
* 函数名称 : Gas_GetGasPart2                                                                                                         
* 功能描述 : 获得充气部位2                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : GasPart2  --    b0    CalvesBot           腿底  
*                            b1    CalvesSide          腿侧
*                            b2    CalvesSideHold      腿侧 保压
*                            b3    
*                            b4      
*                            b5         
*                            b6     
*                            b7               
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
GasPart2_t Gas_GetGasPart2(void)
{
  return pGas->GasPart.Part2;
}

/*
************************************************************************************************************************
* 函数名称 : Gas_SetGasPart                                                                                                         
* 功能描述 : 设置充气部位                                                                                     
* 输入参数 :    Part1  --    b0    SeatSide           座侧 
*                            b1    LumbarSide         腰侧
*                            b2    ArmsRF             右手臂前
*                            b3    ArmsRB             右手臂后
*                            b4    ArmsLF             左手臂前
*                            b5    ArmsLB             左手臂后
*                            b6    ShoulderSide       肩侧
*
*            Part2  -----    b0    CalvesBot           腿底  
*                            b1    CalvesSide          腿侧
*                            b2    CalvesSideHold      腿侧 保压
*                            b3    
*                            b4      
*                            b5         
*                            b6     
*                            b7                
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_SetGasPart(uint8_t Part1, uint8_t Part2)
{
  uint8_t Keep, Change;

  Keep = pGas->GasPart.Part1.All & (~pGas->GasPartCtrlEn.Part1.All); /*将需要控制的清零，不需要控制的保持*/
  Change = Part1 & pGas->GasPartCtrlEn.Part1.All;                    /*将需要控制的使用Part1赋值，不需要控制的清零，*/                  
  pGas->GasPart.Part1.All = Keep | Change;                           /*需要控制的 与 保持的 叠加*/

  Keep = pGas->GasPart.Part2.All & (~pGas->GasPartCtrlEn.Part2.All); /*将需要控制的清零，不需要控制的保持*/
  Change = Part2 & pGas->GasPartCtrlEn.Part2.All;                    /*将需要控制的使用Part2赋值，不需要控制的清零，*/                   
  pGas->GasPart.Part2.All = Keep | Change;                           /*需要控制的 与 保持的 叠加*/
}

/*
************************************************************************************************************************
* 函数名称 : Gas_SetGasPartCtrlEnOnly                                                                                                         
* 功能描述 : 设置充气部位控制的使能，Only表示使用Part1 和 Part2的值直接进行设置更改                                                                                     
* 输入参数 :    Part1  --    b0    SeatSide           座侧 
*                            b1    LumbarSide         腰侧
*                            b2    ArmsRF             右手臂前
*                            b3    ArmsRB             右手臂后
*                            b4    ArmsLF             左手臂前
*                            b5    ArmsLB             左手臂后
*                            b6    ShoulderSide       肩侧
*
*            Part2  -----    b0    CalvesBot           腿底  
*                            b1    CalvesSide          腿侧
*                            b2    CalvesSideHold      腿侧 保压
*                            b3    
*                            b4      
*                            b5         
*                            b6     
*                            b7                     
* 返回参数 : 无                                                                 
* 补充说明 : 只有GasPartEnCtr 中相关位为1的 才允许控制充气IO。
*            为0的 则不允许控制，IO将保持在最后一次的控制状态。                                                                                                          
************************************************************************************************************************
*/
void Gas_SetGasPartCtrlEnOnly(uint8_t Part1, uint8_t Part2)
{
  pGas->GasPartCtrlEn.Part1.All = Part1;       
  pGas->GasPartCtrlEn.Part2.All = Part2;       
}

/*
************************************************************************************************************************
* 函数名称 : Gas_SetGasPartCtrlEnAdd                                                                                                         
* 功能描述 : 设置充气部位控制的使能，Add表示使用Part1 和 Part2的值进行追加设置。                                                                                      
* 输入参数 :    Part1  --    b0    SeatSide           座侧 
*                            b1    LumbarSide         腰侧
*                            b2    ArmsRF             右手臂前
*                            b3    ArmsRB             右手臂后
*                            b4    ArmsLF             左手臂前
*                            b5    ArmsLB             左手臂后
*                            b6    ShoulderSide       肩侧
*
*            Part2  -----    b0    CalvesBot           腿底  
*                            b1    CalvesSide          腿侧
*                            b2    CalvesSideHold      腿侧 保压
*                            b3    
*                            b4      
*                            b5         
*                            b6     
*                            b7                     
* 返回参数 : 无                                                                 
* 补充说明 : 只有GasPartEnCtr 中相关位为1的 才允许控制充气IO。
*            为0的 则不允许控制，IO将保持在最后一次的控制状态。                                                                                                          
************************************************************************************************************************
*/
void Gas_SetGasPartCtrlEnAdd(uint8_t Part1, uint8_t Part2)
{
  pGas->GasPartCtrlEn.Part1.All |= Part1;       
  pGas->GasPartCtrlEn.Part2.All |= Part2;       
}

/*
************************************************************************************************************************
* 函数名称 : Gas_SetPump                                                                                                          
* 功能描述 : 设置气泵开关                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_SetPumpSw(uint8_t OnOff)
{
  pGas->CSFlag.Bit.PumpSw = OnOff;
}

/*
************************************************************************************************************************
* 函数名称 : Gas_ActionHandle                                                                                                         
* 功能描述 : 充气动作处理                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_ActionHandle(Ticker_t ExePeriod)
{
//  static Ticker_t CalvesSideHoldLeakageTimeMs;   /*泄气时间*/
  
  /*暂停则停止充气 --------------------------------------*/
  if(pGas->CSFlag.Bit.Pause > 0)
  {
    pGas->GasPart.Part1.All = 0;
    pGas->GasPart.Part2.All = 0;
    pGas->CSFlag.Bit.PumpSw = 0;
  }

  pGas->SetQry0x48.CalvesPressureThreshold = pGas->CalvesPressureThresholdSet;
  pGas->SetQry0x48.Byte0.Bit.GasCalvesBot  = pGas->GasPart.Part2.Bit.CalvesBot;
  pGas->SetQry0x48.Byte0.Bit.GasCalvesSide = pGas->GasPart.Part2.Bit.CalvesSide;

/*小腿板带气压检测，将根据相应的CalvesPressureThreshold自动控制保压，不需要下面的代码来控制保压了*/  
//  if(pGas->GasPart.Part2.Bit.CalvesSideHold)         /*保压*/
//  {
//    pGas->SetQry0x48.Byte0.Bit.GasCalvesSide     = 0;
//    pGas->SetQry0x48.Byte0.Bit.GasCalvesSideHold = 0;
//  }
//  else                                           
//  {
//    if( pGas->GasPart.Part2.Bit.CalvesSide)              /*充气*/
//    {
//      pGas->SetQry0x48.Byte0.Bit.GasCalvesSide = 1;
//      pGas->SetQry0x48.Byte0.Bit.GasCalvesSideHold = 0;
//      
//      CalvesSideHoldLeakageTimeMs = 0;
//    }
//    else
//    {
//      pGas->SetQry0x48.Byte0.Bit.GasCalvesSide = 0;      /*泄气*/
//      if(CalvesSideHoldLeakageTimeMs < 50000)
//      {
//        CalvesSideHoldLeakageTimeMs += ExePeriod;
//        pGas->SetQry0x48.Byte0.Bit.GasCalvesSideHold = 1;
//      }
//      else
//      {
//        pGas->SetQry0x48.Byte0.Bit.GasCalvesSideHold = 0;  /*完成泄气后，关闭泄气阀的电*/
//      }
//    }
//  }
  
  BSP_IO_SetOutput_PumpGasCtrl(pGas->CSFlag.Bit.PumpSw, pGas->GasPart.Part1.All, pGas->GasPart.Part2.All);
}

/*
************************************************************************************************************************
* 函数名称 : Gas_GetCSFlag                                                                                                         
* 功能描述 : 获得 控制 与 状态 标识                                                                                    
* 输入参数 : 无                                                                                      
* 返回参数 : 控制与状态标识 的结构体                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
GasCSFlag_t Gas_GetCSFlag(void)
{
  return pGas->CSFlag;
}

/*
************************************************************************************************************************
* 函数名称 : Pump_ActionHandle                                                                                                         
* 功能描述 :                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 :                                                                  
* 补充说明 : 控制气泵开关                                                                                                         
************************************************************************************************************************
*/
void Pump_ActionHandle(Ticker_t ExePeriod)
{
  /*暂停则停止充气 --------------------------------------*/
  if(pGas->CSFlag.Bit.Pause > 0)
  {
    pGas->CSFlag.Bit.PumpSw = 0;
  }
  BSP_IO_SetOutput_PumpCtrl(pGas->CSFlag.Bit.PumpSw);
}

/*
========================================================================================================================
*         充气功能函数表                           充气功能函数表                           充气功能函数表
========================================================================================================================
*/
#define  GAS_TICK_COUNT_BUF_NUM   2
static Ticker_t Gas_TickCount[GAS_TICK_COUNT_BUF_NUM];

static const ESF_TmrExeFunc_t  Gas_TmrExeFuncTab[] = 
{
  /*   执行函数             执行周期(ms)      时间计数变量*/
  {Gas_ActionHandle,        10,               &Gas_TickCount[0]},
  {Pump_ActionHandle,        1,               &Gas_TickCount[1]}

};

#define  GAS_TMR_EXE_FUNC_TAB_NUM     TAB_NUM(Gas_TmrExeFuncTab)

/*
************************************************************************************************************************
* 函数名称 : Gas_Init                                                                                                         
* 功能描述 : 充气初始化                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : 返回 可操作充气功能 的结构体 的指针                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
Gas_t* Gas_Init(void)
{
  /*初始化相关数据------------------------------------------*/
  memset(pGas, 0, sizeof(Gas_t)); /*清零所有数据*/

  /*检测 Gas_TmrExeFuncTab 功能函数表排列是否正确------------------------*/
  ESF_TmrExeFuncTabCheck(Gas_TmrExeFuncTab, GAS_TMR_EXE_FUNC_TAB_NUM, GAS_TICK_COUNT_BUF_NUM);

  return pGas;
}

/*
************************************************************************************************************************
* 函数名称 : Gas_Handle                                                                                                         
* 功能描述 : 充气处理                                                                                     
* 输入参数 : 无                                                                                      
* 返回参数 : 无                                                                 
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void Gas_Handle(void)
{
  /*调度功能函数表------------------------------------------------*/
  ESF_TmrExeFuncScheduling(Gas_TmrExeFuncTab, GAS_TMR_EXE_FUNC_TAB_NUM);
}


/*
************************************************************************************************************************
* 函数名称 : Gas_CDPDataObjRx_0x48                                                                                      
* 功能描述 : 0x48 腿脚充气控制(中心板<-->腿脚控制板）
* 输入参数 : pRxDU   -- 指向接收的数据对象单元
*            pAckDU  -- 指向应答的数据对象单元
*            SrcAddr -- 数据的来源
*            Cmd     -- 命令
* 返回参数 : 处理成功：该数据对象中数据的长度    
             处理出错：CDP_DU_HANDLE_ERR 数据处理出错
* 补充说明 : 无
************************************************************************************************************************
*/
uint8_t Gas_CDPDataObjRx_0x48(uint8_t *pRxDU, uint8_t *pAckDU, uint8_t SrcAddr, uint8_t Cmd)
{
  /*更新数据到中心板-------------------------------------------------------------*/
  memcpy((uint8_t *)&pGas->SetQry0x48, &pRxDU[CDP_DU_OFFSET_LEN], pRxDU[CDP_DU_OFFSET_LEN]);

  pGas->CalvesPressureThresholdCur = pGas->SetQry0x48.CalvesPressureThreshold;
  
  return pRxDU[CDP_DU_OFFSET_LEN];
}

/*
************************************************************************************************************************
* 函数名称 : Gas_CDPDataObjTx_0x48                                                                                      
* 功能描述 : 0x48 腿脚充气控制(中心板<-->腿脚控制板）
* 输入参数 : 无
* 返回参数 : 成功则返回要发送的数据的内存首地址，失败返回NULL空指针
* 补充说明 : 无
************************************************************************************************************************
*/
uint8_t* Gas_CDPDataObjTx_0x48(void)
{
  pGas->SetQry0x48.DataLen = sizeof(pGas->SetQry0x48);  
  pGas->SetQry0x48.DataID = 0x48;  

  return (uint8_t *)&pGas->SetQry0x48;
}
