/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: CDP_Xxx_Ctrl.c                                                                                                         
**
**    功能描述: 通信数据包   之   手控器 <--> 中心板。
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "CDP_Xxx_Ctrl.h"
#include "CDP.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/
#define  Xxx_CTRL_RX_BUF_SIZE         (ESF_MEM_BOLCK_BYTE_SIZE - (ESF_MEM_BOLCK_BYTE_SIZE/4)) /*接收缓存大小，最多占内存块的3/4*/
#define  Xxx_CTRL_TX_BUF_SIZE         (Xxx_CTRL_RX_BUF_SIZE)                                  /*发送缓存大小*/
#define  Xxx_CTRL_UART_PORT            BSP_UART_Port2					/*260中心板使用串口1*/          /*所用串口*/


/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/
static CDP_XxxCtrl_t CDP_XxxCtrl;
CDP_XxxCtrl_t *pCDP_XxxCtrl = &CDP_XxxCtrl;


/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/

/*
************************************************************************************************************************
* 函数名称 : CDP_CtrlToXxx_ByteRx                                                                                                         
* 功能描述 : 通信数据包   之   手控器 --> 中心板   字节接收处理                                                                              
* 输入参数 : RxByte -- 收到的字节数据                                                                    
* 返回参数 : 无                                                             
* 补充说明 : 该函数必须通笲SP_UART_RegRxByteCB()注册给BSP层，以便在串口接收字节中断中调用。                                                                                                  
************************************************************************************************************************
*/
 char RxData_Wifi[300];
 uint16_t RxData_Count;
 uint8_t RxHandleFlag;
 uint8_t RxHandleFlag1;
 uint8_t Rx_Time;
static void CDP_CtrlToXxx_ByteRx(uint8_t RxByte)
{
	RxData_Wifi[RxData_Count++] = RxByte;
	Rx_Time = 0;                     //时间清零
	RxHandleFlag1 = 1;
	if(RxData_Count >= 300)
	{
		RxHandleFlag = 1;
//	  RxData_Count = 0;
	}
}

/*
************************************************************************************************************************
* 函数名称 : CDP_XxxToCtrl_DataTx                                                                                                         
* 功能描述 : 通信数据包   之   中心板 --> 手控器    数据发送                                                                      
* 输入参数 : pTXData -- 要发送的数据   
*            TxLen   -- 发送长度 
* 返回参数 : BSP_UART_TxState_Busy  -- 发送忙，无法处理发送pTxBuf指向的的数据。
*            其他值                 -- 串口开始发送pTxBuf指向的的数据了。
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
uint8_t CDP_XxxToCtrl_DataTx(ESF_Evt_t *pEvt)
{
//  static uint8_t FrameTxBuf[Xxx_CTRL_TX_BUF_SIZE];
//  uint8_t *wp;
//  uint16_t i;
//  uint8_t sum;
//  
//  
//  if(BSP_UART_TxState_Busy == BSP_UART_GetTxState(Xxx_CTRL_UART_PORT))
//  {
//    return BSP_UART_TxState_Busy;    /*发送忙，则返回*/
//  }
//  
//  sum = CumulativeSum_Cal(pEvt->Arg.CDPTx.pTxBuf, pEvt->Arg.CDPTx.TxLen); 
//  pEvt->Arg.CDPTx.pTxBuf[pEvt->Arg.CDPTx.TxLen++] = sum;

//  wp = FrameTxBuf;
//  *wp++ = CDP_FRAME_HEADER;
//  for(i=0; i<pEvt->Arg.CDPTx.TxLen; i++)
//  {
//    if((CDP_FRAME_BOUNDARY == pEvt->Arg.CDPTx.pTxBuf[i]) || 
//       (CDP_FRAME_ESC      == pEvt->Arg.CDPTx.pTxBuf[i]) )
//    {
//      *wp++ = CDP_FRAME_ESC;
//      *wp++ = pEvt->Arg.CDPTx.pTxBuf[i] ^ 0x03;
//    }
//    else
//    {
//      *wp++ = pEvt->Arg.CDPTx.pTxBuf[i];
//    }
//  }
//  *wp++ = CDP_FRAME_FOOTER;
//  
//  return BSP_UART_TxData(Xxx_CTRL_UART_PORT, FrameTxBuf, (wp - FrameTxBuf));
}

/*
************************************************************************************************************************
* 函数名称 : CDP_XxxCtrl_Init                                                                                                         
* 功能描述 : 通信数据包   之   手控器 <--> 中心板   初始化                                                                               
* 输入参数 : 无                                                            
* 返回参数 : 返回 可操作的结构体 的指针                                                             
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
CDP_XxxCtrl_t* CDP_XxxCtrl_Init(void)
{
  /*初始化相关数据------------------------------------------*/
  //memset(pCDP_XxxCtrl, 0, sizeof(CDP_XxxCtrl_t));

  BSP_UART_RegRxByteCB(Xxx_CTRL_UART_PORT, CDP_CtrlToXxx_ByteRx);   /*注册串口接收处理函数*/

  return pCDP_XxxCtrl;
}

/*
************************************************************************************************************************
* 函数名称 : CDP_XxxCtrl_GetCSFlag                                                                                                         
* 功能描述 : 获得 控制 与 状态 标识                                                                
* 输入参数 : 无                                                                   
* 返回参数 : 控制与状态标识 的结构体                                                             
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
CDP_XxxCtrlCSFlag_t CDP_XxxCtrl_GetCSFlag(void)
{
  return pCDP_XxxCtrl->CSFlag;
}
