/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: CDP_CenServer.c                                                                                                         
**
**    功能描述: 通信数据包   之   中心板 <--> 服务器。
**
**    公    司: 蒙发利电子
**
**    项目名称:
**
**    平台信息:
**
**    作    者: LZH
**
**    其他说明: 
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "CDP_CenServer.h"
#include "CDP.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/
#define  CEN_SERVER_RX_BUF_SIZE                 (ESF_MEM_BOLCK_BYTE_SIZE - (ESF_MEM_BOLCK_BYTE_SIZE/4))  /*接收缓存大小，最多占内存块的3/4*/
#define  CEN_SERVER_TX_BUF_SIZE                 (CEN_SERVER_RX_BUF_SIZE)                                 /*发送缓存大小*/
#define  CEN_SERVER_UART_PORT                   BSP_UART_Port2                                           /*所用串口*/

#define  CEN_SERVER_LINK_LOST_TIME_THRESHOLD    (180)                                                    /*通信链接丢失时间门限 单位S*/

/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/
static CDP_CenServer_t CDP_CenServer;
CDP_CenServer_t *pCDP_CenServer = &CDP_CenServer;

/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/

/*
************************************************************************************************************************
* 函数名称 : CDP_CenServer_ByteRx                                                                                                         
* 功能描述 : 通信数据包   之    中心板 <--> 上位机   字节接收处理                                                                              
* 输入参数 : RxByte -- 收到的字节数据                                                                    
* 返回参数 : 无                                                             
* 补充说明 : 该函数必须通过BSP_UART_RegRxByteCB()注册给BSP层，以便在串口接收字节中断中调用。                                                                                                  
************************************************************************************************************************
*/
static void CDP_CenServer_ByteRx(uint8_t RxByte)
{
  uint8_t SrcAddr;
  
  pCDP_CenServer->FrameRx.RxLenMax = CEN_SERVER_RX_BUF_SIZE;
  SrcAddr = CDP_FrameRxHandle(&pCDP_CenServer->FrameRx, RxByte, CDP_TYPE_NEW_PROTOCOL, CDP_DAP_CEN);
  
  if(CDP_ADDR_SERVER == SrcAddr)                            
  {
    pCDP_CenServer->ServerLinkLostTimeMs = 0;                                     /*清链接丢失时间*/ 
    pCDP_CenServer->ServerLinkLostTimeSec = 0;
    pCDP_CenServer->CSFlag.Bit.LinkLostFault = NORMAL;  
  }
}

/*
************************************************************************************************************************
* 函数名称 : CDP_CenServer_DataTx                                                                                                         
* 功能描述 : 通信数据包   之  中心板 <--> 上位机      数据发送                                                                      
* 输入参数 : pTXData -- 要发送的数据   
*            TxLen   -- 发送长度 
* 返回参数 : BSP_UART_TxState_Busy  -- 发送忙，无法处理发送pTxBuf指向的的数据。
*            其他值                 -- 串口开始发送pTxBuf指向的的数据了。
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
uint8_t CDP_CenServer_DataTx(ESF_Evt_t *pEvt)
{
  static uint8_t FrameTxBuf[CEN_SERVER_TX_BUF_SIZE];

  return CDP_FrameTxHandle(pEvt, FrameTxBuf, CEN_SERVER_UART_PORT);
}

/*
************************************************************************************************************************
* 函数名称 : CDP_CenServer_FaultCheck                                                                                                         
* 功能描述 : 通信数据包   之   中心板 <--> Server   故障检测                                                                        
* 输入参数 : 无                                                             
* 返回参数 : 无                                                             
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
void CDP_CenServer_FaultCheck(Ticker_t ExePeriod)
{
  if(OFF == BSP_IO_GetERPPowerSwState())/*ERP电源关闭，Xxx电源也被关闭，就不做故障判断*/
  {
    pCDP_CenServer->ServerLinkLostTimeMs = 0;                                     /*清链接丢失时间*/ 
    pCDP_CenServer->CSFlag.Bit.LinkLostFault = NORMAL;  
    return; 
  }
  
  if(pCDP_CenServer->ServerLinkLostTimeSec < CEN_SERVER_LINK_LOST_TIME_THRESHOLD)
  {
    pCDP_CenServer->ServerLinkLostTimeMs += ExePeriod;
    if(pCDP_CenServer->ServerLinkLostTimeMs > 1000)
    {
      pCDP_CenServer->ServerLinkLostTimeMs -= 1000;
      pCDP_CenServer->ServerLinkLostTimeSec ++;
    }
  }
  else
  {
    pCDP_CenServer->CSFlag.Bit.LinkLostFault = FAULT; /*丢失超过门限，则表示链接丢失*/
  }
  
//  if(pCDP_CenServer->FrameRx.ByteRxTimeOutMs < 100)
//  {
//    pCDP_CenServer->FrameRx.ByteRxTimeOutMs += ExePeriod;
//  }
}

/*
************************************************************************************************************************
* 函数名称 : CDP_CenDebug_Init                                                                                                         
* 功能描述 : 通信数据包   之   中心板 <--> 上位机   初始化                                                                               
* 输入参数 : 无                                                            
* 返回参数 : 返回 可操作的结构体 的指针                                                             
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
CDP_CenServer_t* CDP_CenServer_Init(void)
{
  /*初始化相关数据------------------------------------------*/

  memset(pCDP_CenServer, 0, sizeof(CDP_CenServer_t));
  BSP_UART_RegRxByteCB(CEN_SERVER_UART_PORT, CDP_CenServer_ByteRx);   /*注册串口接收处理函数*/

  return pCDP_CenServer;
}

/*
************************************************************************************************************************
* 函数名称 : CDP_CenServer_GetCSFlag                                                                                                         
* 功能描述 : 获得 控制 与 状态 标识                                                                
* 输入参数 : 无                                                                   
* 返回参数 : 控制与状态标识 的结构体                                                             
* 补充说明 : 无                                                                                                  
************************************************************************************************************************
*/
CDP_CenServerCSFlag_t CDP_CenServer_GetCSFlag(void)
{
  return pCDP_CenServer->CSFlag;
}

