/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称：ESF.h 
**
**    功能描述: ESF 框架的总头文件，应用程序唯一一个需要包含的ESF框架头文件。
**
**    项目名称：Easy SoftWare FrameWork (简单 软件框架)
**
**    平台信息：
**
**    作    者：Hzy
**
**    版    本：V1.0
**
**    其他说明:
**
**    修改记录: --------------------------------------------------------------
**              2015.08    
**              完成 V1.0 版本
**              --------------------------------------------------------------
**              2016.06 
**              升级到V1.1版本。主要是为了简化有关事件和内存分配释放的使用。
**              1、去掉事件内存池相关内容。 
**              2、修改 ESF_Evt_t结构体，增加变量AppendData[1]; 
**              3、修改 ESF_Cfg.h文件，使得配置功能更明了简便。
**
========================================================================================================================
========================================================================================================================
*/
#ifndef ESF_H
#define ESF_H


/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "bsp.h"
#include "CommonLib.h"
#include "ESF_Cfg.h"
#include "ESF_CPU.h"
#include "ESF_Mem.h"
#include "ESF_Evt.h"
#include "ESF_Tmr.h"
 

/*
========================================================================================================================
*【全局宏定义】                                       【全局宏定义】                                       【全局宏定义】
========================================================================================================================
*/
#ifndef  EFS_FALSE
#define  EFS_FALSE                     0u
#endif

#ifndef  EFS_TRUE
#define  EFS_TRUE                      1u
#endif

#ifndef  EFS_EXE_FAIL
#define  EFS_EXE_FAIL                  1u
#endif

#ifndef  EFS_EXE_SUCCESS
#define  EFS_EXE_SUCCESS               0u
#endif

#ifndef  EFS_ASCII_NULL
#define  EFS_ASCII_NULL         (int8_t)0
#endif

#ifndef  EFS_P_NULL
#define  EFS_P_NULL              (void*)0
#endif

#ifndef  NULL
#define  NULL                    (void*)0
#endif

#ifndef  null
#define  null                    (void*)0
#endif


/*================================================================
**	            错误编码定义 
=================================================================*/
#define  EFS_ERR_NONE                        0u    /*无错误*/

#define  EFS_ERR_MEM_NO_FREE_BLKS            1u    /*无空闲的内存块*/
#define  EFS_ERR_MEM_FULL                    2u    /*内存池满*/
#define  EFS_ERR_MEM_INVALID_BLKS            3u    /*无效的内存块*/
#define  EFS_ERR_MEM_INVALID_ADDR            4u    /*无效的内存地址*/

#define  EFS_ERR_EVT_MEM_NO_FREE_BLKS        5u    /*无空闲的事件内存块*/
#define  EFS_ERR_EVT_MEM_FULL                6u    /*事件内存池满*/
#define  EFS_ERR_EVT_MEM_NVALID_BLKS         7u    /*无效的事件内存块*/
#define  EFS_ERR_EVT_MEM_INVALID_ADDR        8u    /*无效的事件内存地址*/

#define  EFS_ERR_EVT_QUENE_FULL              9u    /*事件队列满*/



/*
========================================================================================================================
*【全局数据类型定义】                              【全局数据类型定义】                              【全局数据类型定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 类型定义 :                                                                               
************************************************************************************************************************
*/



/*
========================================================================================================================
*【对外声明】                                          【对外声明】                                          【对外声明】
========================================================================================================================
*/
void ESF_Init(void);



#endif
