/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: Gas.h                                                                                                         
**
**    功能描述: 气泵、气囊驱动。
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/
#ifndef  _GAS_H
#define  _GAS_H


/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "bsp.h"
#include "CDP.h"


/*
========================================================================================================================
*【全局宏定义】                                       【全局宏定义】                                       【全局宏定义】
========================================================================================================================
*/



/*
========================================================================================================================
*【全局数据类型定义】                              【全局数据类型定义】                              【全局数据类型定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 类型定义 :  充气 控制与状态标识                                                                                      
************************************************************************************************************************
*/
typedef  union 
{
  struct
  {
    uint8_t    Work                   :1;    /*工作中*/
    uint8_t    Pause                  :5;    /*暂停*/
    uint8_t    Run                    :1;    /*运行*/
    uint8_t    PumpSw                 :1;    /*气泵开关*/
  }Bit;

  uint8_t All;
}GasCSFlag_t;  /*Control State Flag  控制与状态标识*/

/*
************************************************************************************************************************
* 类型定义 :  充气部位1                                                                              
************************************************************************************************************************
*/
__packed typedef union 
{
  uint8_t    All;
  __packed struct
  {
    uint8_t    SeatSide              :1;    /*座侧*/  
    uint8_t    LumbarSide            :1;    /*腰侧*/    
    uint8_t    ArmsRF                :1;    /*右手臂前*/   
    uint8_t    ArmsRB                :1;    /*右手臂后*/   
    uint8_t    ArmsLF                :1;    /*左手臂前*/    
    uint8_t    ArmsLB                :1;    /*左手臂后*/   
    uint8_t    ShoulderSide          :1;    /*肩侧*/   
  }Bit;
  
}GasPart1_t;   

/*
************************************************************************************************************************
* 类型定义 :  充气部位2                                                                              
************************************************************************************************************************
*/
__packed typedef union 
{
  uint8_t    All;
  __packed struct
  {
    uint8_t    CalvesBot             :1;    /*腿底 充气*/  
    uint8_t    CalvesSide            :1;    /*腿侧 充气*/  
    uint8_t    CalvesSideHold        :1;    /*腿侧 保压*/  
 }Bit;
}GasPart2_t;   

/*
************************************************************************************************************************
* 类型定义 :  充气部位                                                                              
************************************************************************************************************************
*/
__packed typedef struct 
{
  GasPart1_t  Part1;
  GasPart2_t  Part2;
}GasPart_t;          /*充气部位*/


/*
************************************************************************************************************************
* 类型定义 :  充气动作                                                                            
************************************************************************************************************************
*/
typedef  union
{
  uint16_t All;
  struct
  {
    uint8_t       Head               :1;      /*头部*/
    uint8_t       Shoulder           :1;      /*肩部*/
    uint8_t       Arms               :1;      /*手臂*/
    uint8_t       Lumbar             :1;      /*腰*/
    uint8_t       Seat               :1;      /*坐*/
    uint8_t       LumbarSeat         :1;      /*腰坐*/
    uint8_t       Calves             :1;      /*腿*/
    uint8_t       Feet               :1;      /*脚*/
    uint8_t       CalvesFeet         :1;      /*腿脚*/
  }Bit;   
}GasAction_t;   

/*
************************************************************************************************************************
* 类型定义 :  充气操作相关数据结构                                                                           
************************************************************************************************************************
*/
typedef struct
{
  GasCSFlag_t  CSFlag;          /*控制与状态标识*/

  GasPart_t    GasPart;         /*充气部位*/
  GasPart_t    GasPartCtrlEn;   /*充气部位使能控制*/

  uint8_t      CalvesPressureThresholdSet;
  uint8_t      CalvesPressureThresholdCur;
  
  CDP_DataFormat0x48_t    SetQry0x48;
}Gas_t;


/*
========================================================================================================================
*【对外声明】                                          【对外声明】                                          【对外声明】
========================================================================================================================
*/
/*初始化--------------------------------------*/
Gas_t* Gas_Init(void);

/*周期执行--------------------------------------*/
void Gas_Handle(void);


/* 对外的接口， 即 其他模块 可对 该模块执行的 控制操作*/
void Gas_SetCalvesPressureThreshold(uint8_t GasIntensity);

void Gas_PauseOn(void);
void Gas_PauseOff(void);
GasPart1_t Gas_GetGasPart1(void);
GasPart2_t Gas_GetGasPart2(void);
void Gas_SetPumpSw(uint8_t OnOff);
void Gas_SetGasPart(uint8_t Part1, uint8_t Part2);
void Gas_SetGasPartCtrlEnOnly(uint8_t Part1, uint8_t Part2);
void Gas_SetGasPartCtrlEnAdd(uint8_t Part1, uint8_t Part2);
  
#define  Gas_HeadCtrlEnOnly()         Gas_SetGasPartCtrlEnOnly(B(00000000), B(00000000))  /*头部充气控制使能，其他部位控制关闭*/               
#define  Gas_ShoulderCtrlEnOnly()     Gas_SetGasPartCtrlEnOnly(B(01000000), B(00000000))  /*肩部充气控制使能，其他部位控制关闭*/               
#define  Gas_ArmsCtrlEnOnly()         Gas_SetGasPartCtrlEnOnly(B(00111100), B(00000000))  /*手臂充气控制使能，其他部位控制关闭*/                     
#define  Gas_LumbarSeatCtrlEnOnly()   Gas_SetGasPartCtrlEnOnly(B(00000011), B(00000000))  /*腰座充气控制使能，其他部位控制关闭*/            
#define  Gas_LumbarCtrlEnOnly()       Gas_SetGasPartCtrlEnOnly(B(00000010), B(00000000))  /*腰部充气控制使能，其他部位控制关闭*/            
#define  Gas_SeatCtrlEnOnly()         Gas_SetGasPartCtrlEnOnly(B(00000001), B(00000000))  /*座部充气控制使能，其他部位控制关闭*/            
#define  Gas_CalvesFeetCtrlEnOnly()   Gas_SetGasPartCtrlEnOnly(B(00000000), B(00000111))  /*腿脚充气控制使能，其他部位控制关闭*/  
#define  Gas_CalvesCtrlEnOnly()       Gas_SetGasPartCtrlEnOnly(B(00000000), B(00000111))  /*腿部充气控制使能，其他部位控制关闭*/
#define  Gas_FeetCtrlEnOnly()         Gas_SetGasPartCtrlEnOnly(B(00000000), B(00000111))  /*脚部充气控制使能，其他部位控制关闭*/                  

#define  Gas_HeadCtrlEnAdd()          Gas_SetGasPartCtrlEnAdd(B(00000000), B(00000000))   /*头部充气控制使能，其他部位控制保持*/               
#define  Gas_ShoulderCtrlEnAdd()      Gas_SetGasPartCtrlEnAdd(B(01000000), B(00000000))   /*肩部充气控制使能，其他部位控制保持*/               
#define  Gas_ArmsCtrlEnAdd()          Gas_SetGasPartCtrlEnAdd(B(00111100), B(00000000))   /*手臂充气控制使能，其他部位控制保持*/                     
#define  Gas_LumbarSeatCtrlEnAdd()    Gas_SetGasPartCtrlEnAdd(B(00000011), B(00000000))   /*腰座充气控制使能，其他部位控制保持*/            
#define  Gas_LumbarCtrlEnAdd()        Gas_SetGasPartCtrlEnAdd(B(00000010), B(00000000))   /*腰部充气控制使能，其他部位控制保持*/            
#define  Gas_SeatCtrlEnAdd()          Gas_SetGasPartCtrlEnAdd(B(00000001), B(00000000))   /*座部充气控制使能，其他部位控制保持*/            
#define  Gas_CalvesFeetCtrlEnAdd()    Gas_SetGasPartCtrlEnAdd(B(00000000), B(00000111))   /*腿脚充气控制使能，其他部位控制保持*/  
#define  Gas_CalvesCtrlEnAdd()        Gas_SetGasPartCtrlEnAdd(B(00000000), B(00000111))   /*腿部充气控制使能，其他部位控制保持*/
#define  Gas_FeetCtrlEnAdd()          Gas_SetGasPartCtrlEnAdd(B(00000000), B(00000111))   /*脚部充气控制使能，其他部位控制保持*/                  

#define  Gas_AllCtrlEn()              Gas_SetGasPartCtrlEnOnly(B(11111111), B(11111111))  /*所有部位充气控制使能*/   

GasCSFlag_t Gas_GetCSFlag(void);

#endif
