/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: Heat.h                                                                                                         
**
**    功能描述: 加热驱动。
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/
#ifndef  _HEAT_H
#define  _HEAT_H

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "bsp.h"
#include "CDP.h"


/*
========================================================================================================================
*【全局宏定义】                                       【全局宏定义】                                       【全局宏定义】
========================================================================================================================
*/
#define  HEAT_FEET_EN                  0
#define  HEAT_CALVES_EN                0
#define  HEAT_SEAT_EN                  0
#define  HEAT_LUMBARBACK_EN            1

/*
========================================================================================================================
*【全局数据类型定义】                              【全局数据类型定义】                              【全局数据类型定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 类型定义 :  加热动作                                                                               
* 注：每个部位的功能占用3位，即可用值为0~7  
************************************************************************************************************************
*/
typedef union
{
  uint16_t All;
  struct
  {
    uint8_t       Feet           :3;    /*脚部*/
    uint8_t       Calves         :3;    /*腿部*/
    uint8_t       Seat           :3;    /*座部*/
    uint8_t       LumbarBack     :3;    /*腰背*/
  }Bit;   
}HeatAction_t; 

/*
************************************************************************************************************************
* 类型定义 :  加热 控制与状态标识                                                                        
************************************************************************************************************************
*/
typedef union 
{
  uint32_t All[2];
  struct
  {
    uint8_t            FeetWork                         :1;    /*工作中*/
    uint8_t            FeetPause                        :5;    /*暂停*/
    uint8_t            FeetRun                          :1;    /*运行*/
    uint8_t            FeetLocked                       :1;    /*被锁，不能再工作*/

    uint8_t            CalvesWork                       :1;    /*工作中*/
    uint8_t            CalvesPause                      :5;    /*暂停*/
    uint8_t            CalvesRun                        :1;    /*运行*/
    uint8_t            CalvesLocked                     :1;    /*被锁，不能再工作*/
    
    uint8_t            SeatWork                         :1;    /*工作中*/
    uint8_t            SeatPause                        :5;    /*暂停*/
    uint8_t            SeatRun                          :1;    /*运行*/
    uint8_t            SeatLocked                       :1;    /*被锁，不能再工作*/
    
    uint8_t            LumbarBackWork                   :1;    /*工作中*/
    uint8_t            LumbarBackPause                  :5;    /*暂停*/
    uint8_t            LumbarBackRun                    :1;    /*运行*/
    uint8_t            LumbarBackThyristorShortFault    :1;    /*可控硅短路 故障*/
    uint8_t            LumbarBackThermistorShortFault   :1;    /*热敏电阻短路 故障*/
    uint8_t            LumbarBackThermistorOpenFault    :1;    /*热敏电阻开路 故障*/
    uint8_t            LumbarBackLocked                 :1;    /*被锁，不能再工作*/
  }Bit;
}HeatCSFlag_t;  /*Control State Flag  控制与状态标识*/

/*
************************************************************************************************************************
* 类型定义 :  加热操作相关数据结构                                                                          
************************************************************************************************************************
*/
typedef struct
{
  HeatCSFlag_t         CSFlag;                           /*控制与状态标识*/

  CDP_DataFormat0x41_t SetQry0x41;
}Heat_t;


/*
========================================================================================================================
*【对外声明】                                          【对外声明】                                          【对外声明】
========================================================================================================================
*/
/*初始化--------------------------------------*/
Heat_t*  Heat_Init(void);


/*周期执行--------------------------------------*/
void Heat_Handle(void);


/* 对外的接口， 即 其他模块 可对 该模块执行的 控制操作*/
void Heat_SetFeetHeatWorkState(uint8_t  TrueFalse);
void Heat_FeetHeatPauseOn(void);
void Heat_FeetHeatPauseOff(void);

void Heat_SetCalvesHeatWorkState(uint8_t  TrueFalse);
void Heat_CalvesHeatPauseOn(void);
void Heat_CalvesHeatPauseOff(void);

void Heat_SetSeatHeatWorkState(uint8_t  TrueFalse);
void Heat_SeatHeatPauseOn(void);
void Heat_SeatHeatPauseOff(void);

void Heat_SetLumbarBackHeatWorkState(uint8_t  TrueFalse);
void Heat_LumbarBackHeatPauseOn(void);
void Heat_LumbarBackHeatPauseOff(void);

HeatCSFlag_t Heat_GetCSFlag(void);

int8_t Heat_GetFeetTemperature(void);
int8_t Heat_GetLumbarBackLeftTemperature(void);
int8_t Heat_GetLumbarBackRightTemperature(void);

#endif
