/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: SysMode_VenderInspectManual.c 
**
**    功能描述: 系统模式 之  厂家手检
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "SysMode.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/


/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : SysMode_InspectManual_Timer                                                                                                         
* 功能描述 : 厂家手检 定时器 处理                                                                                        
* 输入参数 : 无                                                                                     
* 返回参数 : 无                                                                
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void SysMode_InspectManual_Timer(Ticker_t ExePeriod)
{
  if(pMChair->SysModeCur != SYS_MODE_INSPECTMANUAL)
  {
    return;
  }

  pMChair->CommonTimeSec++;

  Gas_SetPumpSw(ON);
  Gas_AllCtrlEn();
  switch(pMChair->CommonStep)
  {
    case 0:
    {
      Gas_SetGasPart(B(00000000), B(00000000));
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 1:
    {
      Gas_SetGasPart(B(01000000), B(00000000));  /*肩部*/
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 2:
    {
      Gas_SetGasPart(B(01000010), B(00000000));  /*肩部 腰侧*/
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 3:
    {
      Gas_SetGasPart(B(01000110), B(00000000));  /*肩部 腰侧 右手臂前*/
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 4:
    {
      Gas_SetGasPart(B(01001110), B(00000000));  /*肩部 腰侧 右手臂前 右手臂后*/
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 5:
    {
      Gas_SetGasPart(B(01011110), B(00000000));  /*肩部 腰侧 右手臂前 右手臂后 左手臂前*/
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 6:
    {
      Gas_SetGasPart(B(01111110), B(00000000));  /*肩部 腰侧 右手臂前 右手臂后 左手臂前 左手臂后*/
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 7:
    {
      Gas_SetGasPart(B(01111111), B(00000000));  /*肩部 腰侧 右手臂前 右手臂后 左手臂前 左手臂后 座侧 */
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;
    
    case 8:
    {
      Gas_SetGasPart(B(01111111), B(00000001));  /*肩部 腰侧 右手臂前 右手臂后 左手臂前 左手臂后 座侧 腿底  */
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    case 9:
    {
      Gas_SetGasPart(B(01111111), B(00000011));  /*肩部 腰侧 右手臂前 右手臂后 左手臂前 左手臂后 座侧 腿底 腿侧 */
      pMChair->CommonTimeSec = 0;
      pMChair->CommonStep++;
    }break;

    default:
    {
      Gas_SetGasPart(B(01111111), B(00000011));  /*肩部 腰侧 右手臂前 右手臂后 左手臂前 左手臂后 座侧 腿底 腿侧 */
      if(pMChair->CommonTimeSec > 12)            /*敲击循环 敲5s --> 停5s */
      {
        pMChair->CommonTimeSec = 0;
        Core_SetTCSAction(CORE_ACTION_EXE_NONE, TCS_ACTION_NONE);
        Heat_SetLumbarBackHeatWorkState(FALSE);
        Roller_SetFeetRollerWorkState(FALSE);
        Roller_SetCalvesRollerWorkState(FALSE);
        Led_SetLogoWorkState(FALSE);  
        Led_SetProjectionWorkState(FALSE);  
      }
      else if(pMChair->CommonTimeSec > 6)
      {
        Core_SetTCSAction(CORE_ACTION_EXE_NONE, TAP);
        Heat_SetLumbarBackHeatWorkState(TRUE);
        Roller_SetFeetRollerWorkState(TRUE);
        Roller_SetCalvesRollerWorkState(TRUE);
        Led_SetLogoWorkState(TRUE);  
        Led_SetProjectionWorkState(TRUE);  
      }
    }break;
  }
}


/*
************************************************************************************************************************
* 函数名称 : SysMode_InspectManual_Init                                                                                                         
* 功能描述 : 系统模式 之 厂家手检 初始化                                                                                        
* 输入参数 : 无                                                                                     
* 返回参数 : 无                                                                
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void SysMode_InspectManual_Init(void)
{

}

/*
************************************************************************************************************************
* 函数名称 : SysMode_InspectManual_Handle                                                                                                         
* 功能描述 : 系统模式 之  厂家手检 处理                                                                                        
* 输入参数 : 无                                                                                     
* 返回参数 : 无                                                                
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void SysMode_InspectManual_Handle(void)
{
  /*发生模式切换操作-----------------------------------------------------*/
  if(pMChair->SysModeHis != pMChair->SysModeCur)      
  {
    pMChair->SysModeHis = pMChair->SysModeCur; 
  }

  /*根据各个模式的不同，对键值处理相关变量赋值---------------------------*/
  SysMode_DefaultKeyValHandle();
}
