/*
========================================================================================================================
**【文件描述】                                        【文件描述】                                        【文件描述】**
========================================================================================================================
**    文件名称: SysMode_VenderInspectOther1.c 
**
**    功能描述: 系统模式 之  其他厂家检测 1
**
**    公    司：蒙发利电子
**
**    项目名称：
**
**    平台信息：
**
**    作    者：Hzy
**
**    其他说明:
**
**    修改记录:  --------------------------------------------------------------
**
========================================================================================================================
========================================================================================================================
*/

/*
========================================================================================================================
* 【文件包含】                                         【文件包含】                                          【文件包含】
========================================================================================================================
*/
#include "SysMode.h"


/*
========================================================================================================================
*【本地宏定义】                                       【本地宏定义】                                       【本地宏定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【本地数据类型定义】                              【本地数据类型定义】                              【本地数据类型定义】
========================================================================================================================
*/


/*
========================================================================================================================
*【变量定义 & 各种声明】                          【变量定义 & 各种声明】                          【变量定义 & 各种声明】    
========================================================================================================================
*/


/*
========================================================================================================================
*【函数定义】                                          【函数定义】                                          【函数定义】
========================================================================================================================
*/
/*
************************************************************************************************************************
* 函数名称 : SysMode_InspectOther1_Timer                                                                                                         
* 功能描述 : 其他厂家检测1 定时器 处理                                                                                       
* 输入参数 : ExePeriod -- 执行周期                                                                                
* 返回参数 : 无                                                                    
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void SysMode_InspectOther1_Timer(Ticker_t ExePeriod)
{
  if(pMChair->SysModeCur != SYS_MODE_INSPECTOTHER1)
  {
    return;
  }

  /*开加热--------------------------------------------------------*/
  Heat_SetLumbarBackHeatWorkState(TRUE);  
  Heat_SetFeetHeatWorkState(TRUE);  

  /*机芯 运动-----主要做负荷检查----------------------------------*/
  pMChair->CommonTimeSec++;
  switch(pMChair->CommonStep)
  {
    /*靠背升起来，小腿收起来---------------------------*/
    case 0:
    {
      Spike_SetFeetAngle(PFEET00);
      Spike_SetBackAngle(PBACK00);
      if((PFEET00 == Spike_GetFeetAngle()) &&
         (PBACK00 == Spike_GetBackAngle()) )
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;
      
    case 1:
    {
      if(pMChair->CommonTimeSec >= 5) /*5s，让操作员先放下负载。*/
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;


    /*行走极点和异音测试-----------------------------*/
    case 2:
    {
      Core_SetYPosition(PY_MAX);
      if(PY_MAX == Core_GetYPosition())
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;

    case 3:
    {
      Core_SetYPosition(PY20);
      if(PY20 == Core_GetYPosition())
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;


    /*伸缩极点和异音测试-----------------------------*/
    case 4:
    {
      Core_SetZPosition(PZ05);
      if(PZ05 == Core_GetZPosition())
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;

    case 5:
    {
      Core_SetZPosition(PZ01);
      if(PZ01 == Core_GetZPosition())
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;

    case 6:
    {
      Core_SetZPosition(PZ03);
      if(PZ03 == Core_GetZPosition())
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;

    /*揉捏与敲击测试-----------------------------*/
    case 7:
    {
      Core_SetTCSAction(CORE_ACTION_EXE_NONE, TAP);
      Core_SetXYZAction(CORE_ACTION_EXE_NONE, KNIN);
      if(pMChair->CommonTimeSec > 10)
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;

    case 8:
    {
      Core_SetTCSAction(CORE_ACTION_EXE_NONE, TAP);
      Core_SetXYZAction(CORE_ACTION_EXE_NONE, KNOUT);
      if(pMChair->CommonTimeSec > 10)
      {
        pMChair->CommonTimeSec = 0;
        pMChair->CommonStep++;
      }
    }break;

    /*完成--------------------------------------------*/
    default:
    {
      Core_SetAction(CORE_ACTION_EXE_NONE, XYZ_ACTION_NONE, TCS_ACTION_NONE);
      Core_SetXYZPosition(PXWIDE, PYTOP, PZBACK); 
      if((PX02 == Core_GetXPosition()) &&
         (PY00 == Core_GetYPosition()) && 
         (PZ01 == Core_GetZPosition()) )
      {
        pMChair->CSFlag.Bit.VenderOpFinish = TRUE; /*厂家操作完成*/
      }
    }break;
  }
}

/*
************************************************************************************************************************
* 函数名称 : SysMode_InspectOther1_Init                                                                                                         
* 功能描述 : 系统模式 之 其他厂家检测1 初始化                                                                                       
* 输入参数 : 无                                                                          
* 返回参数 : 无                                                             
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void SysMode_InspectOther1_Init(void)
{

}

/*
************************************************************************************************************************
* 函数名称 : SysMode_InspectOther1_Handle                                                                                                         
* 功能描述 : 系统模式 之 其他厂家检测1 处理                                                                                       
* 输入参数 : 无                                                                              
* 返回参数 : 无                                                                  
* 补充说明 : 无                                                                                                         
************************************************************************************************************************
*/
void SysMode_InspectOther1_Handle(void)
{
  /*发生模式切换操作-----------------------------------------------------*/
  if(pMChair->SysModeHis != pMChair->SysModeCur)      
  {
    pMChair->SysModeHis = pMChair->SysModeCur; 
  }

  /*根据各个模式的不同，对键值处理相关变量赋值---------------------------*/
  SysMode_DefaultKeyValHandle();
}
